import { Chapter } from "./types";

export const CHAPTER = {
  "frequencies": [
    [
      "的",
      216
    ],
    [
      "了",
      77
    ],
    [
      "我",
      77
    ],
    [
      "是",
      63
    ],
    [
      "他",
      52
    ],
    [
      "一",
      42
    ],
    [
      "哈利",
      39
    ],
    [
      "你",
      38
    ],
    [
      "不",
      37
    ],
    [
      "她",
      36
    ],
    [
      "就",
      31
    ],
    [
      "说",
      29
    ],
    [
      "在",
      28
    ],
    [
      "会",
      22
    ],
    [
      "信",
      20
    ],
    [
      "魔法",
      20
    ],
    [
      "想",
      20
    ],
    [
      "爸爸",
      20
    ],
    [
      "有",
      18
    ],
    [
      "对",
      18
    ],
    [
      "妈妈",
      17
    ],
    [
      "一个",
      16
    ],
    [
      "来",
      16
    ],
    [
      "要",
      15
    ],
    [
      "还",
      14
    ],
    [
      "他们",
      14
    ],
    [
      "也",
      14
    ],
    [
      "如果",
      14
    ],
    [
      "自己",
      14
    ],
    [
      "霍",
      14
    ],
    [
      "很",
      13
    ],
    [
      "格沃茨",
      13
    ],
    [
      "着",
      12
    ],
    [
      "看",
      12
    ],
    [
      "好",
      12
    ],
    [
      "佩妮",
      11
    ],
    [
      "这",
      11
    ],
    [
      "可以",
      11
    ],
    [
      "可是",
      11
    ],
    [
      "只",
      11
    ],
    [
      "都",
      10
    ],
    [
      "起来",
      10
    ],
    [
      "从",
      10
    ],
    [
      "教授",
      10
    ],
    [
      "用",
      10
    ],
    [
      "把",
      10
    ],
    [
      "给",
      10
    ],
    [
      "能",
      9
    ],
    [
      "过",
      9
    ],
    [
      "去",
      9
    ],
    [
      "上",
      8
    ],
    [
      "和",
      8
    ],
    [
      "个",
      8
    ],
    [
      "让",
      8
    ],
    [
      "知道",
      8
    ],
    [
      "可能",
      8
    ],
    [
      "话",
      8
    ],
    [
      "这个",
      8
    ],
    [
      "相信",
      8
    ],
    [
      "猫头鹰",
      8
    ],
    [
      "下",
      7
    ],
    [
      "书",
      7
    ],
    [
      "出来",
      7
    ],
    [
      "到",
      7
    ],
    [
      "又",
      7
    ],
    [
      "没",
      7
    ],
    [
      "我们",
      7
    ],
    [
      "那",
      7
    ],
    [
      "做",
      7
    ],
    [
      "因为",
      7
    ],
    [
      "才",
      7
    ],
    [
      "得",
      7
    ],
    [
      "人",
      7
    ],
    [
      "存在",
      7
    ],
    [
      "比",
      6
    ],
    [
      "被",
      6
    ],
    [
      "科学",
      6
    ],
    [
      "斯",
      6
    ],
    [
      "封",
      6
    ],
    [
      "地",
      6
    ],
    [
      "声音",
      6
    ],
    [
      "迈克",
      6
    ],
    [
      "真",
      6
    ],
    [
      "事",
      6
    ],
    [
      "吗",
      6
    ],
    [
      "这种",
      6
    ],
    [
      "什么",
      6
    ],
    [
      "呢",
      6
    ],
    [
      "然后",
      6
    ],
    [
      "时候",
      6
    ],
    [
      "事情",
      6
    ],
    [
      "您",
      6
    ],
    [
      "出",
      5
    ],
    [
      "书架",
      5
    ],
    [
      "或者",
      5
    ],
    [
      "看到",
      5
    ],
    [
      "但是",
      5
    ],
    [
      "非常",
      5
    ],
    [
      "亲爱",
      5
    ],
    [
      "怎么",
      5
    ],
    [
      "一下",
      5
    ],
    [
      "一直",
      5
    ],
    [
      "像",
      5
    ],
    [
      "莉莉",
      5
    ],
    [
      "孩子",
      5
    ],
    [
      "拿",
      5
    ],
    [
      "问题",
      5
    ],
    [
      "验证",
      5
    ],
    [
      "放",
      4
    ],
    [
      "小",
      4
    ],
    [
      "维瑞斯",
      4
    ],
    [
      "信封",
      4
    ],
    [
      "写",
      4
    ],
    [
      "不过",
      4
    ],
    [
      "没有",
      4
    ],
    [
      "可",
      4
    ],
    [
      "丈夫",
      4
    ],
    [
      "见",
      4
    ],
    [
      "叫",
      4
    ],
    [
      "听",
      4
    ],
    [
      "这样",
      4
    ],
    [
      "开始",
      4
    ],
    [
      "父母",
      4
    ],
    [
      "里",
      4
    ],
    [
      "次",
      4
    ],
    [
      "真的",
      4
    ],
    [
      "一样",
      4
    ],
    [
      "兴趣",
      4
    ],
    [
      "这么",
      4
    ],
    [
      "考虑",
      4
    ],
    [
      "奇怪",
      4
    ],
    [
      "寄",
      4
    ],
    [
      "张",
      4
    ],
    [
      "一会儿",
      4
    ],
    [
      "录取",
      4
    ],
    [
      "向",
      4
    ],
    [
      "道",
      3
    ],
    [
      "住",
      3
    ],
    [
      "层",
      3
    ],
    [
      "数学",
      3
    ],
    [
      "詹姆·波特",
      3
    ],
    [
      "家",
      3
    ],
    [
      "客厅",
      3
    ],
    [
      "认为",
      3
    ],
    [
      "表现",
      3
    ],
    [
      "开玩笑",
      3
    ],
    [
      "妹妹",
      3
    ],
    [
      "弄弯",
      3
    ],
    [
      "勺子",
      3
    ],
    [
      "名字",
      3
    ],
    [
      "觉得",
      3
    ],
    [
      "求",
      3
    ],
    [
      "点",
      3
    ],
    [
      "世界",
      3
    ],
    [
      "啦",
      3
    ],
    [
      "再",
      3
    ],
    [
      "变",
      3
    ],
    [
      "以后",
      3
    ],
    [
      "一些",
      3
    ],
    [
      "解释",
      3
    ],
    [
      "为什么",
      3
    ],
    [
      "不对",
      3
    ],
    [
      "偶然",
      3
    ],
    [
      "意见",
      3
    ],
    [
      "请",
      3
    ],
    [
      "过来",
      3
    ],
    [
      "感",
      3
    ],
    [
      "争",
      3
    ],
    [
      "哪里",
      3
    ],
    [
      "反正",
      3
    ],
    [
      "按",
      3
    ],
    [
      "完全",
      3
    ],
    [
      "决定",
      3
    ],
    [
      "收到",
      3
    ],
    [
      "理论",
      3
    ],
    [
      "格",
      3
    ],
    [
      "脸",
      3
    ],
    [
      "尖叫",
      2
    ],
    [
      "墙上",
      2
    ],
    [
      "几乎",
      2
    ],
    [
      "有的",
      2
    ],
    [
      "堆",
      2
    ],
    [
      "两",
      2
    ],
    [
      "后面",
      2
    ],
    [
      "满",
      2
    ],
    [
      "桌子",
      2
    ],
    [
      "这里",
      2
    ],
    [
      "迈克·维瑞斯",
      2
    ],
    [
      "伊万",
      2
    ],
    [
      "夫人",
      2
    ],
    [
      "佩妮·伊万",
      2
    ],
    [
      "·",
      2
    ],
    [
      "伊万斯",
      2
    ],
    [
      "还有",
      2
    ],
    [
      "贴",
      2
    ],
    [
      "邮票",
      2
    ],
    [
      "上面",
      2
    ],
    [
      "收件人",
      2
    ],
    [
      "H·波特",
      2
    ],
    [
      "先生",
      2
    ],
    [
      "并",
      2
    ],
    [
      "女巫",
      2
    ],
    [
      "坚持",
      2
    ],
    [
      "巫师",
      2
    ],
    [
      "荒唐",
      2
    ],
    [
      "指出",
      2
    ],
    [
      "参加",
      2
    ],
    [
      "别",
      2
    ],
    [
      "告诉",
      2
    ],
    [
      "小声",
      2
    ],
    [
      "翻",
      2
    ],
    [
      "眼睛",
      2
    ],
    [
      "那种",
      2
    ],
    [
      "嘴唇",
      2
    ],
    [
      "办法",
      2
    ],
    [
      "咽",
      2
    ],
    [
      "现在",
      2
    ],
    [
      "指",
      2
    ],
    [
      "变美",
      2
    ],
    [
      "吧",
      2
    ],
    [
      "很多",
      2
    ],
    [
      "可笑",
      2
    ],
    [
      "理由",
      2
    ],
    [
      "姐姐",
      2
    ],
    [
      "后来",
      2
    ],
    [
      "礼",
      2
    ],
    [
      "肯",
      2
    ],
    [
      "男",
      2
    ],
    [
      "啊",
      2
    ],
    [
      "写信",
      2
    ],
    [
      "帮",
      2
    ],
    [
      "病",
      2
    ],
    [
      "而且",
      2
    ],
    [
      "生病",
      2
    ],
    [
      "亲眼",
      2
    ],
    [
      "一定",
      2
    ],
    [
      "件",
      2
    ],
    [
      "深",
      2
    ],
    [
      "吸",
      2
    ],
    [
      "口",
      2
    ],
    [
      "气",
      2
    ],
    [
      "你们",
      2
    ],
    [
      "送",
      2
    ],
    [
      "吵",
      2
    ],
    [
      "承认",
      2
    ],
    [
      "假",
      2
    ],
    [
      "实验",
      2
    ],
    [
      "方法",
      2
    ],
    [
      "争论",
      2
    ],
    [
      "解决",
      2
    ],
    [
      "身",
      2
    ],
    [
      "低头",
      2
    ],
    [
      "认真",
      2
    ],
    [
      "十",
      2
    ],
    [
      "岁",
      2
    ],
    [
      "最",
      2
    ],
    [
      "任何",
      2
    ],
    [
      "买",
      2
    ],
    [
      "所",
      2
    ],
    [
      "男孩",
      2
    ],
    [
      "当然",
      2
    ],
    [
      "称职",
      2
    ],
    [
      "家长",
      2
    ],
    [
      "赢",
      2
    ],
    [
      "读",
      2
    ],
    [
      "那样",
      2
    ],
    [
      "条",
      2
    ],
    [
      "行",
      2
    ],
    [
      "而",
      2
    ],
    [
      "瞪",
      2
    ],
    [
      "爱",
      2
    ],
    [
      "闭",
      2
    ],
    [
      "不可救药",
      2
    ],
    [
      "身后",
      2
    ],
    [
      "门",
      2
    ],
    [
      "真实",
      2
    ],
    [
      "借口",
      2
    ],
    [
      "可疑",
      2
    ],
    [
      "情况",
      2
    ],
    [
      "出现",
      2
    ],
    [
      "部分",
      2
    ],
    [
      "确信",
      2
    ],
    [
      "学校",
      2
    ],
    [
      "揉",
      2
    ],
    [
      "想法",
      2
    ],
    [
      "本",
      2
    ],
    [
      "确定",
      2
    ],
    [
      "挥挥",
      2
    ],
    [
      "说不定",
      2
    ],
    [
      "脑子",
      2
    ],
    [
      "心里",
      2
    ],
    [
      "耸",
      2
    ],
    [
      "猜想",
      2
    ],
    [
      "打",
      2
    ],
    [
      "纸",
      2
    ],
    [
      "副",
      2
    ],
    [
      "校长",
      2
    ],
    [
      "莉莉·波特",
      2
    ],
    [
      "莉莉·伊万",
      2
    ],
    [
      "已经",
      2
    ],
    [
      "并且",
      2
    ],
    [
      "用品",
      2
    ],
    [
      "派",
      2
    ],
    [
      "滴",
      2
    ],
    [
      "多么",
      2
    ],
    [
      "厨房",
      2
    ],
    [
      "吵架",
      2
    ],
    [
      "可怕",
      2
    ],
    [
      "似乎",
      2
    ],
    [
      "多",
      2
    ],
    [
      "测试",
      2
    ],
    [
      "那个",
      2
    ],
    [
      "继续",
      2
    ],
    [
      "感觉",
      2
    ],
    [
      "想到",
      2
    ],
    [
      "飞来",
      2
    ],
    [
      "叼走",
      2
    ],
    [
      "举",
      2
    ],
    [
      "花园里",
      2
    ],
    [
      "天空",
      2
    ],
    [
      "喊",
      2
    ],
    [
      "邻居",
      2
    ],
    [
      "篱笆",
      2
    ],
    [
      "伸",
      2
    ],
    [
      "费",
      2
    ],
    [
      "答道",
      2
    ],
    [
      "过去",
      2
    ],
    [
      "月光",
      1
    ],
    [
      "细小",
      1
    ],
    [
      "银色",
      1
    ],
    [
      "闪光",
      1
    ],
    [
      "发丝",
      1
    ],
    [
      "细",
      1
    ],
    [
      "穿",
      1
    ],
    [
      "黑色",
      1
    ],
    [
      "袍子",
      1
    ],
    [
      "身影",
      1
    ],
    [
      "倒下",
      1
    ],
    [
      "鲜血",
      1
    ],
    [
      "大量",
      1
    ],
    [
      "涌出",
      1
    ],
    [
      "有人",
      1
    ],
    [
      "词",
      1
    ],
    [
      "------------------------------------------------",
      1
    ],
    [
      "每",
      1
    ],
    [
      "寸",
      1
    ],
    [
      "空间",
      1
    ],
    [
      "盖",
      1
    ],
    [
      "每个",
      1
    ],
    [
      "六",
      1
    ],
    [
      "碰到",
      1
    ],
    [
      "天花板",
      1
    ],
    [
      "满满地",
      1
    ],
    [
      "精装",
      1
    ],
    [
      "书册",
      1
    ],
    [
      "历史",
      1
    ],
    [
      "各种各样",
      1
    ],
    [
      "其他",
      1
    ],
    [
      "分",
      1
    ],
    [
      "平装本",
      1
    ],
    [
      "科幻小说",
      1
    ],
    [
      "书用",
      1
    ],
    [
      "旧",
      1
    ],
    [
      "纸巾",
      1
    ],
    [
      "盒子",
      1
    ],
    [
      "木块",
      1
    ],
    [
      "垫",
      1
    ],
    [
      "以便",
      1
    ],
    [
      "越过",
      1
    ],
    [
      "前排",
      1
    ],
    [
      "后排",
      1
    ],
    [
      "书名",
      1
    ],
    [
      "溢",
      1
    ],
    [
      "沙发",
      1
    ],
    [
      "窗户",
      1
    ],
    [
      "下边",
      1
    ],
    [
      "堆成",
      1
    ],
    [
      "小堆",
      1
    ],
    [
      "德高望重",
      1
    ],
    [
      "养子",
      1
    ],
    [
      "黄色",
      1
    ],
    [
      "羊皮纸",
      1
    ],
    [
      "翠绿",
      1
    ],
    [
      "墨水",
      1
    ],
    [
      "正和",
      1
    ],
    [
      "针锋相对",
      1
    ],
    [
      "谈话",
      1
    ],
    [
      "提高",
      1
    ],
    [
      "大喊大叫",
      1
    ],
    [
      "缺乏",
      1
    ],
    [
      "教养",
      1
    ],
    [
      "语气",
      1
    ],
    [
      "表明",
      1
    ],
    [
      "担心",
      1
    ],
    [
      "重复说",
      1
    ],
    [
      "害怕",
      1
    ],
    [
      "立场",
      1
    ],
    [
      "尖锐",
      1
    ],
    [
      "婚礼",
      1
    ],
    [
      "圣诞节",
      1
    ],
    [
      "来过",
      1
    ],
    [
      "\"",
      1
    ],
    [
      "理解",
      1
    ],
    [
      "怀疑主义",
      1
    ],
    [
      "文献",
      1
    ],
    [
      "熟悉",
      1
    ],
    [
      "恐怕",
      1
    ],
    [
      "专业",
      1
    ],
    [
      "魔术师",
      1
    ],
    [
      "轻而易举",
      1
    ],
    [
      "做到",
      1
    ],
    [
      "记得",
      1
    ],
    [
      "教",
      1
    ],
    [
      "貌似",
      1
    ],
    [
      "看穿",
      1
    ],
    [
      "思想",
      1
    ],
    [
      "技巧",
      1
    ],
    [
      "冷",
      1
    ],
    [
      "分析",
      1
    ],
    [
      "咬着",
      1
    ],
    [
      "口水",
      1
    ],
    [
      "好像",
      1
    ],
    [
      "优美",
      1
    ],
    [
      "曲线",
      1
    ],
    [
      "多年",
      1
    ],
    [
      "美",
      1
    ],
    [
      "凶",
      1
    ],
    [
      "想象",
      1
    ],
    [
      "感受",
      1
    ],
    [
      "至少",
      1
    ],
    [
      "眼里",
      1
    ],
    [
      "蓄",
      1
    ],
    [
      "泪珠",
      1
    ],
    [
      "同意",
      1
    ],
    [
      "编了",
      1
    ],
    [
      "引发",
      1
    ],
    [
      "末日",
      1
    ],
    [
      "半人马",
      1
    ],
    [
      "警告",
      1
    ],
    [
      "最最",
      1
    ],
    [
      "恨死",
      1
    ],
    [
      "大学",
      1
    ],
    [
      "毕业",
      1
    ],
    [
      "名叫",
      1
    ],
    [
      "威农·德思",
      1
    ],
    [
      "男孩子",
      1
    ],
    [
      "约会",
      1
    ],
    [
      "胖",
      1
    ],
    [
      "唯一",
      1
    ],
    [
      "说话",
      1
    ],
    [
      "大儿子",
      1
    ],
    [
      "叫做",
      1
    ],
    [
      "达",
      1
    ],
    [
      "力",
      1
    ],
    [
      "什么样",
      1
    ],
    [
      "起名",
      1
    ],
    [
      "达力·德思",
      1
    ],
    [
      "一刻",
      1
    ],
    [
      "清清楚楚",
      1
    ],
    [
      "将来",
      1
    ],
    [
      "受不了",
      1
    ],
    [
      "停住",
      1
    ],
    [
      "总而言之",
      1
    ],
    [
      "屈服",
      1
    ],
    [
      "危险",
      1
    ],
    [
      "不在乎",
      1
    ],
    [
      "喝",
      1
    ],
    [
      "药水",
      1
    ],
    [
      "生",
      1
    ],
    [
      "几",
      1
    ],
    [
      "星期",
      1
    ],
    [
      "粉刺",
      1
    ],
    [
      "身材",
      1
    ],
    [
      "变成",
      1
    ],
    [
      "美女",
      1
    ],
    [
      "大家",
      1
    ],
    [
      "声音哽咽",
      1
    ],
    [
      "恨",
      1
    ],
    [
      "何况",
      1
    ],
    [
      "带",
      1
    ],
    [
      "结局",
      1
    ],
    [
      "温柔",
      1
    ],
    [
      "卧床",
      1
    ],
    [
      "缘故",
      1
    ],
    [
      "丰满",
      1
    ],
    [
      "皮肤",
      1
    ],
    [
      "改变",
      1
    ],
    [
      "饮食",
      1
    ],
    [
      "习惯",
      1
    ],
    [
      "重复",
      1
    ],
    [
      "说道",
      1
    ],
    [
      "渐渐",
      1
    ],
    [
      "不耐烦",
      1
    ],
    [
      "明",
      1
    ],
    [
      "佩妮绞",
      1
    ],
    [
      "双手",
      1
    ],
    [
      "快要",
      1
    ],
    [
      "哭",
      1
    ],
    [
      "亲爱的",
      1
    ],
    [
      "停下来",
      1
    ],
    [
      "刚刚",
      1
    ],
    [
      "想起",
      1
    ],
    [
      "屋子",
      1
    ],
    [
      "第三",
      1
    ],
    [
      "莫名其妙",
      1
    ],
    [
      "那么",
      1
    ],
    [
      "\"佩妮",
      1
    ],
    [
      "不止",
      1
    ],
    [
      "佩妮瞥",
      1
    ],
    [
      "眼",
      1
    ],
    [
      "表演",
      1
    ],
    [
      "坚决",
      1
    ],
    [
      "暗自",
      1
    ],
    [
      "希望",
      1
    ],
    [
      "哪怕",
      1
    ],
    [
      "听听",
      1
    ],
    [
      "见证",
      1
    ],
    [
      "成",
      1
    ],
    [
      "用处",
      1
    ],
    [
      "不用",
      1
    ],
    [
      "转",
      1
    ],
    [
      "平常",
      1
    ],
    [
      "不屑一顾",
      1
    ],
    [
      "得啦",
      1
    ],
    [
      "本来",
      1
    ],
    [
      "期望",
      1
    ],
    [
      "不至于",
      1
    ],
    [
      "儿子",
      1
    ],
    [
      "即使",
      1
    ],
    [
      "世上",
      1
    ],
    [
      "反科学",
      1
    ],
    [
      "嘴边",
      1
    ],
    [
      "掠过",
      1
    ],
    [
      "丝",
      1
    ],
    [
      "苦笑",
      1
    ],
    [
      "大部分",
      1
    ],
    [
      "亲生",
      1
    ],
    [
      "父亲",
      1
    ],
    [
      "小学",
      1
    ],
    [
      "失败",
      1
    ],
    [
      "大把",
      1
    ],
    [
      "缺",
      1
    ],
    [
      "钱",
      1
    ],
    [
      "花",
      1
    ],
    [
      "大学生",
      1
    ],
    [
      "中",
      1
    ],
    [
      "雇人",
      1
    ],
    [
      "私人",
      1
    ],
    [
      "老师",
      1
    ],
    [
      "学习",
      1
    ],
    [
      "令",
      1
    ],
    [
      "课题",
      1
    ],
    [
      "竞赛",
      1
    ],
    [
      "只要",
      1
    ],
    [
      "合理",
      1
    ],
    [
      "要求",
      1
    ],
    [
      "满足",
      1
    ],
    [
      "除了",
      1
    ],
    [
      "也许",
      1
    ],
    [
      "一丁点儿",
      1
    ],
    [
      "尊重",
      1
    ],
    [
      "堂堂",
      1
    ],
    [
      "牛津大学",
      1
    ],
    [
      "生化",
      1
    ],
    [
      "屈尊",
      1
    ],
    [
      "听取",
      1
    ],
    [
      "样子",
      1
    ],
    [
      "所以",
      1
    ],
    [
      "自认为",
      1
    ],
    [
      "才怪",
      1
    ],
    [
      "费曼",
      1
    ],
    [
      "物理学",
      1
    ],
    [
      "讲义",
      1
    ],
    [
      "第一",
      1
    ],
    [
      "册",
      1
    ],
    [
      "第二",
      1
    ],
    [
      "章",
      1
    ],
    [
      "1",
      1
    ],
    [
      "里面",
      1
    ],
    [
      "哲学家",
      1
    ],
    [
      "曾经",
      1
    ],
    [
      "实际上",
      1
    ],
    [
      "错",
      1
    ],
    [
      "规则",
      1
    ],
    [
      "观测",
      1
    ],
    [
      "结果",
      1
    ],
    [
      "最终",
      1
    ],
    [
      "仲裁者",
      1
    ],
    [
      "需要",
      1
    ],
    [
      "观察",
      1
    ],
    [
      "嗯",
      1
    ],
    [
      "一时",
      1
    ],
    [
      "想不起",
      1
    ],
    [
      "理念",
      1
    ],
    [
      "笑",
      1
    ],
    [
      "谢谢",
      1
    ],
    [
      "把头",
      1
    ],
    [
      "抬",
      1
    ],
    [
      "只是",
      1
    ],
    [
      "能够",
      1
    ],
    [
      "妻子",
      1
    ],
    [
      "句",
      1
    ],
    [
      "进入",
      1
    ],
    [
      "争吵",
      1
    ],
    [
      "模式",
      1
    ],
    [
      "愧疚",
      1
    ],
    [
      "感到",
      1
    ],
    [
      "愚蠢",
      1
    ],
    [
      "回",
      1
    ],
    [
      "房间",
      1
    ],
    [
      "宣布",
      1
    ],
    [
      "发抖",
      1
    ],
    [
      "很快",
      1
    ],
    [
      "答案",
      1
    ],
    [
      "亲",
      1
    ],
    [
      "放心",
      1
    ],
    [
      "上楼",
      1
    ],
    [
      "关上",
      1
    ],
    [
      "思考",
      1
    ],
    [
      "本该",
      1
    ],
    [
      "站",
      1
    ],
    [
      "一边",
      1
    ],
    [
      "证据",
      1
    ],
    [
      "按照",
      1
    ],
    [
      "说法",
      1
    ],
    [
      "整个",
      1
    ],
    [
      "保密",
      1
    ],
    [
      "用魔法",
      1
    ],
    [
      "太",
      1
    ],
    [
      "应该",
      1
    ],
    [
      "明显",
      1
    ],
    [
      "撒谎",
      1
    ],
    [
      "疯了",
      1
    ],
    [
      "糟糕",
      1
    ],
    [
      "程度",
      1
    ],
    [
      "升序",
      1
    ],
    [
      "排列",
      1
    ],
    [
      "信箱",
      1
    ],
    [
      "一点点",
      1
    ],
    [
      "精神",
      1
    ],
    [
      "失常",
      1
    ],
    [
      "宇宙",
      1
    ],
    [
      "运行",
      1
    ],
    [
      "可能性",
      1
    ],
    [
      "大多",
      1
    ],
    [
      "心中",
      1
    ],
    [
      "某",
      1
    ],
    [
      "自从",
      1
    ],
    [
      "看见",
      1
    ],
    [
      "号称",
      1
    ],
    [
      "来自",
      1
    ],
    [
      "与",
      1
    ],
    [
      "整件",
      1
    ],
    [
      "前额",
      1
    ],
    [
      "鬼脸",
      1
    ],
    [
      "不要",
      1
    ],
    [
      "所有",
      1
    ],
    [
      "不疑",
      1
    ],
    [
      "发现",
      1
    ],
    [
      "家里",
      1
    ],
    [
      "魔杖",
      1
    ],
    [
      "证",
      1
    ],
    [
      "伪",
      1
    ],
    [
      "比如",
      1
    ],
    [
      "它",
      1
    ],
    [
      "一点",
      1
    ],
    [
      "找",
      1
    ],
    [
      "教授会",
      1
    ],
    [
      "原因",
      1
    ],
    [
      "预感",
      1
    ],
    [
      "问",
      1
    ],
    [
      "大脑",
      1
    ],
    [
      "一般",
      1
    ],
    [
      "擅长",
      1
    ],
    [
      "回答",
      1
    ],
    [
      "搞",
      1
    ],
    [
      "懂",
      1
    ],
    [
      "肩膀",
      1
    ],
    [
      "扇",
      1
    ],
    [
      "块",
      1
    ],
    [
      "金属板",
      1
    ],
    [
      "推",
      1
    ],
    [
      "门把",
      1
    ],
    [
      "拉",
      1
    ],
    [
      "对于",
      1
    ],
    [
      "桌上",
      1
    ],
    [
      "起",
      1
    ],
    [
      "格子",
      1
    ],
    [
      "停",
      1
    ],
    [
      "下来",
      1
    ],
    [
      "重新",
      1
    ],
    [
      "换",
      1
    ],
    [
      "新",
      1
    ],
    [
      "自动",
      1
    ],
    [
      "铅笔",
      1
    ],
    [
      "铅芯",
      1
    ],
    [
      "毫米",
      1
    ],
    [
      "工整",
      1
    ],
    [
      "米勒娃·麦格",
      1
    ],
    [
      ",",
      1
    ],
    [
      "或",
      1
    ],
    [
      "相关",
      1
    ],
    [
      "人士",
      1
    ],
    [
      "最近",
      1
    ],
    [
      "收信人",
      1
    ],
    [
      "清楚",
      1
    ],
    [
      "亲生父母",
      1
    ],
    [
      "婚前",
      1
    ],
    [
      "世",
      1
    ],
    [
      "收养",
      1
    ],
    [
      "上学",
      1
    ],
    [
      "前提",
      1
    ],
    [
      "地方",
      1
    ],
    [
      "会用",
      1
    ],
    [
      "怀疑",
      1
    ],
    [
      "购买",
      1
    ],
    [
      "信上",
      1
    ],
    [
      "列",
      1
    ],
    [
      "提到",
      1
    ],
    [
      "位",
      1
    ],
    [
      "代表",
      1
    ],
    [
      "那时",
      1
    ],
    [
      "家人",
      1
    ],
    [
      "证明了",
      1
    ],
    [
      "确实",
      1
    ],
    [
      "为",
      1
    ],
    [
      "家庭",
      1
    ],
    [
      "同样",
      1
    ],
    [
      "感激",
      1
    ],
    [
      "真诚",
      1
    ],
    [
      "目前",
      1
    ],
    [
      "地址",
      1
    ],
    [
      "折",
      1
    ],
    [
      "进",
      1
    ],
    [
      "根",
      1
    ],
    [
      "蜡烛",
      1
    ],
    [
      "封口",
      1
    ],
    [
      "处",
      1
    ],
    [
      "蜡油",
      1
    ],
    [
      "铅笔刀",
      1
    ],
    [
      "尖刻",
      1
    ],
    [
      "缩写",
      1
    ],
    [
      "H",
      1
    ],
    [
      "J",
      1
    ],
    [
      "P",
      1
    ],
    [
      "E",
      1
    ],
    [
      "V",
      1
    ],
    [
      "发疯",
      1
    ],
    [
      "疯",
      1
    ],
    [
      "风格",
      1
    ],
    [
      "开门",
      1
    ],
    [
      "回到",
      1
    ],
    [
      "楼下",
      1
    ],
    [
      "坐",
      1
    ],
    [
      "高深",
      1
    ],
    [
      "聪明",
      1
    ],
    [
      "准备",
      1
    ],
    [
      "最爱",
      1
    ],
    [
      "吃",
      1
    ],
    [
      "晚饭",
      1
    ],
    [
      "证明",
      1
    ],
    [
      "互相",
      1
    ],
    [
      "不说话",
      1
    ],
    [
      "糟",
      1
    ],
    [
      "片",
      1
    ],
    [
      "沉寂",
      1
    ],
    [
      "假说",
      1
    ],
    [
      "该",
      1
    ],
    [
      "怎样",
      1
    ],
    [
      "料理台",
      1
    ],
    [
      "前转",
      1
    ],
    [
      "呆",
      1
    ],
    [
      "原本",
      1
    ],
    [
      "哦",
      1
    ],
    [
      "信念",
      1
    ],
    [
      "愿意",
      1
    ],
    [
      "伸出",
      1
    ],
    [
      "头",
      1
    ],
    [
      "既然",
      1
    ],
    [
      "能送",
      1
    ],
    [
      "外面",
      1
    ],
    [
      "回信",
      1
    ],
    [
      "声",
      1
    ],
    [
      "看看",
      1
    ],
    [
      "微微",
      1
    ],
    [
      "摇",
      1
    ],
    [
      "摇头",
      1
    ],
    [
      "丢人",
      1
    ],
    [
      "只有",
      1
    ],
    [
      "傻瓜",
      1
    ],
    [
      "居然",
      1
    ],
    [
      "假想",
      1
    ],
    [
      "目睹",
      1
    ],
    [
      "过程",
      1
    ],
    [
      "沾",
      1
    ],
    [
      "东西",
      1
    ],
    [
      "直到",
      1
    ],
    [
      "走",
      1
    ],
    [
      "后门",
      1
    ],
    [
      "来到",
      1
    ],
    [
      "花园",
      1
    ],
    [
      "难",
      1
    ],
    [
      "发生",
      1
    ],
    [
      "不管",
      1
    ],
    [
      "严重",
      1
    ],
    [
      "空中",
      1
    ],
    [
      "口口水",
      1
    ],
    [
      "忽然",
      1
    ],
    [
      "后",
      1
    ],
    [
      "大",
      1
    ],
    [
      "蛮",
      1
    ],
    [
      "尴尬",
      1
    ],
    [
      "强",
      1
    ],
    [
      "算",
      1
    ],
    [
      "遵行",
      1
    ],
    [
      "蠢",
      1
    ],
    [
      "退缩",
      1
    ],
    [
      "听不见",
      1
    ],
    [
      "下定",
      1
    ],
    [
      "决心",
      1
    ],
    [
      "空旷",
      1
    ],
    [
      "沃兹",
      1
    ],
    [
      "困惑",
      1
    ],
    [
      "女声",
      1
    ],
    [
      "问道",
      1
    ],
    [
      "火烫",
      1
    ],
    [
      "把手",
      1
    ],
    [
      "收",
      1
    ],
    [
      "回来",
      1
    ],
    [
      "藏",
      1
    ],
    [
      "贩毒",
      1
    ],
    [
      "黑钱",
      1
    ],
    [
      "整",
      1
    ],
    [
      "羞耻",
      1
    ],
    [
      "发",
      1
    ],
    [
      "烫",
      1
    ],
    [
      "老太太",
      1
    ],
    [
      "头发",
      1
    ],
    [
      "灰白色",
      1
    ],
    [
      "毛茸茸",
      1
    ],
    [
      "发网",
      1
    ],
    [
      "漏",
      1
    ],
    [
      "太太",
      1
    ],
    [
      "临时",
      1
    ],
    [
      "保姆",
      1
    ],
    [
      "干",
      1
    ],
    [
      "没什么",
      1
    ],
    [
      "种",
      1
    ],
    [
      "掐",
      1
    ],
    [
      "喉咙",
      1
    ],
    [
      "似的",
      1
    ],
    [
      "僵住",
      1
    ],
    [
      "是的",
      1
    ],
    [
      "沉默",
      1
    ],
    [
      "七月",
      1
    ],
    [
      "三十一",
      1
    ],
    [
      "号",
      1
    ],
    [
      "之前",
      1
    ],
    [
      "送信",
      1
    ],
    [
      "倒霉",
      1
    ],
    [
      "简直不",
      1
    ],
    [
      "那些",
      1
    ],
    [
      "普通",
      1
    ],
    [
      "布满",
      1
    ],
    [
      "皱纹",
      1
    ],
    [
      "手臂",
      1
    ],
    [
      "开手",
      1
    ],
    [
      "递",
      1
    ],
    [
      "包在",
      1
    ],
    [
      "身上",
      1
    ],
    [
      "女士",
      1
    ],
    [
      "栅栏",
      1
    ],
    [
      "另",
      1
    ],
    [
      "端",
      1
    ],
    [
      "消失了",
      1
    ],
    [
      "寂静",
      1
    ],
    [
      "接着",
      1
    ],
    [
      "孩",
      1
    ],
    [
      "镇静",
      1
    ],
    [
      "低声说",
      1
    ]
  ],
  "lines": [
    {
      "chinese_source": "月光 下 有 一 道 细小 的 银色 闪光 ， 比 发丝 还 细 …… ",
      "english_source": "<p>\n <em>\n  Beneath the moonlight glints a tiny fragment of silver, a\nfraction of a line...\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "moonlight",
              "w": "月光"
            }
          ],
          "moonlight"
        ],
        [
          "translation_word",
          [
            {
              "t": "down",
              "w": "下"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "road",
              "w": "道"
            }
          ],
          "line"
        ],
        [
          "translation_word",
          [
            {
              "t": "tiny",
              "w": "细小"
            }
          ],
          "tiny"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "silver",
              "w": "银色"
            }
          ],
          "silver"
        ],
        [
          "translation_word",
          [
            {
              "t": "flash",
              "w": "闪光"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "compared_to",
              "w": "比"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hair",
              "w": "发丝"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "thin_or_slender",
              "w": "细"
            }
          ],
          "fraction"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "……"
            }
          ],
          ""
        ]
      ]
    },
    {
      "chinese_source": "（ 穿 着 黑色 袍子 的 身影 ， 倒下 ） ",
      "english_source": "<p>\n <em>\n  (black robes, falling)\n </em>\n</p>\n",
      "translation": [
        [
          "punctuation",
          "（"
        ],
        [
          "translation_word",
          [
            {
              "t": "wear",
              "w": "穿"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "black",
              "w": "黑色"
            }
          ],
          "black"
        ],
        [
          "translation_word",
          [
            {
              "t": "Chinese-style_gown",
              "w": "袍子"
            }
          ],
          "robes"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "silhouette",
              "w": "身影"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "collapse",
              "w": "倒下"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "）"
        ]
      ]
    },
    {
      "chinese_source": "…… 鲜血 大量 涌出 ， 有人 尖叫 出 一个 词 。 ",
      "english_source": "<p>\n <em>\n  ...blood spills out in litres, and someone screams a\nword.\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "……"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "blood",
              "w": "鲜血"
            }
          ],
          "blood"
        ],
        [
          "translation_word",
          [
            {
              "t": "great_amount",
              "w": "大量"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "bubble_up",
              "w": "涌"
            },
            {
              "t": "go_out",
              "w": "出"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "someone",
              "w": "有人"
            }
          ],
          "someone"
        ],
        [
          "translation_word",
          [
            {
              "t": "screech",
              "w": "尖叫"
            }
          ],
          "screams"
        ],
        [
          "translation_word",
          [
            {
              "t": "go_out",
              "w": "出"
            }
          ],
          "out"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "word",
              "w": "词"
            }
          ],
          "word"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "------------------------------------------------ ",
      "english_source": "<p>\n <hr noshade=\"noshade\" size=\"1\"/>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "------------------------------------------------"
            }
          ],
          ""
        ]
      ]
    },
    {
      "chinese_source": "墙上 的 每 一 寸 空间 都 被 书架 盖 住 了 。 每个 书架 有 六 层 ， 几乎 碰到 天花板 。 有的 书架 上 满满地 堆 着 精装 的 书册 ： 科学 ， 数学 ， 历史 ， 各种各样 。 其他 的 书架 分 两 层 放 着 平装本 的 科幻小说 ， 后面 一 层 的 书用 旧 纸巾 盒子 或者 木块 垫 起来 ， 以便 越过 前排 的 书 能 看到 后排 的 书名 。 但是 还 是 放 不 下 。 书 从 书架 上 满 出来 ， 溢 到 桌子 和 沙发 上 ， 又 在 窗户 下边 堆成 一 小堆 一 小 堆 的 。 ",
      "english_source": "<p>\n Every inch of wall space is covered by a bookcase. Each bookcase\nhas six shelves, going almost to the ceiling. Some bookshelves are\nstacked to the brim with hardback books: science, maths, history,\nand everything else. Other shelves have two layers of paperback\nscience fiction, with the back layer of books propped up on old\ntissue boxes or lengths of wood, so that you can see the back layer\nof books above the books in front. And it still isn't enough. Books\nare overflowing onto the tables and the sofas and making little\nheaps under the windows.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "wall",
              "w": "墙"
            },
            {
              "t": "above",
              "w": "上"
            }
          ],
          "wall"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "each",
              "w": "每"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "inch",
              "w": "寸"
            }
          ],
          "inch"
        ],
        [
          "translation_word",
          [
            {
              "t": "space",
              "w": "空间"
            }
          ],
          "space"
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "都"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "to_cover",
              "w": "被"
            }
          ],
          "by"
        ],
        [
          "translation_word",
          [
            {
              "t": "bookshelf",
              "w": "书架"
            }
          ],
          "bookcase"
        ],
        [
          "translation_word",
          [
            {
              "t": "cover",
              "w": "盖"
            }
          ],
          "covered"
        ],
        [
          "translation_word",
          [
            {
              "t": "live",
              "w": "住"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "each",
              "w": "每"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "everything"
        ],
        [
          "translation_word",
          [
            {
              "t": "bookshelf",
              "w": "书架"
            }
          ],
          "shelves"
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "six",
              "w": "六"
            }
          ],
          "six"
        ],
        [
          "translation_word",
          [
            {
              "t": "layer",
              "w": "层"
            }
          ],
          "layers"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "almost",
              "w": "几乎"
            }
          ],
          "almost"
        ],
        [
          "translation_word",
          [
            {
              "t": "come_across",
              "w": "碰到"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ceiling",
              "w": "天花板"
            }
          ],
          "ceiling"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "some",
              "w": "有的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "bookshelf",
              "w": "书架"
            }
          ],
          "bookshelves"
        ],
        [
          "translation_word",
          [
            {
              "t": "above",
              "w": "上"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "full",
              "w": "满满"
            },
            {
              "t": "-ly",
              "w": "地"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "pile_up",
              "w": "堆"
            }
          ],
          "stacked"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hardcover",
              "w": "精装"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "book",
              "w": "书"
            },
            {
              "t": "book",
              "w": "册"
            }
          ],
          "books"
        ],
        [
          "punctuation",
          "："
        ],
        [
          "translation_word",
          [
            {
              "t": "science",
              "w": "科学"
            }
          ],
          "science"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "mathematics",
              "w": "数学"
            }
          ],
          "maths"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "history",
              "w": "历史"
            }
          ],
          "history"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "various_kinds",
              "w": "各种各样"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "other",
              "w": "其他"
            }
          ],
          "else"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "bookshelf",
              "w": "书架"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "divide",
              "w": "分"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "two",
              "w": "两"
            }
          ],
          "two"
        ],
        [
          "translation_word",
          [
            {
              "t": "layer",
              "w": "层"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "put",
              "w": "放"
            }
          ],
          "back"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "paperback",
              "w": "平装本"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "science_fiction_novel",
              "w": "科幻小说"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "rear",
              "w": "后面"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "layer",
              "w": "层"
            }
          ],
          "layer"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "book",
              "w": "书"
            },
            {
              "t": "use",
              "w": "用"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "old",
              "w": "旧"
            }
          ],
          "old"
        ],
        [
          "translation_word",
          [
            {
              "t": "paper_towel",
              "w": "纸巾"
            }
          ],
          "tissue"
        ],
        [
          "translation_word",
          [
            {
              "t": "box",
              "w": "盒子"
            }
          ],
          "boxes"
        ],
        [
          "translation_word",
          [
            {
              "t": "or",
              "w": "或者"
            }
          ],
          "or"
        ],
        [
          "translation_word",
          [
            {
              "t": "block",
              "w": "木块"
            }
          ],
          "wood"
        ],
        [
          "translation_word",
          [
            {
              "t": "pad",
              "w": "垫"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stand_up",
              "w": "起来"
            }
          ],
          "up"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "so_that",
              "w": "以便"
            }
          ],
          "so"
        ],
        [
          "translation_word",
          [
            {
              "t": "cross_over",
              "w": "越过"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "front",
              "w": "前"
            },
            {
              "t": "a_row",
              "w": "排"
            }
          ],
          "front"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "book",
              "w": "书"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "能"
            }
          ],
          "can"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "看到"
            }
          ],
          "see"
        ],
        [
          "translation_word",
          [
            {
              "t": "the_back_row",
              "w": "后排"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "name_of_a_book",
              "w": "书名"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "但是"
            }
          ],
          "enough"
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          "still"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "put",
              "w": "放"
            }
          ],
          "onto"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "down",
              "w": "下"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "book",
              "w": "书"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "from",
              "w": "从"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "bookshelf",
              "w": "书架"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "above",
              "w": "上"
            }
          ],
          "above"
        ],
        [
          "translation_word",
          [
            {
              "t": "fill",
              "w": "满"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come_out",
              "w": "出来"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "overflow",
              "w": "溢"
            }
          ],
          "overflowing"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "到"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "table",
              "w": "桌子"
            }
          ],
          "tables"
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "和"
            }
          ],
          "and"
        ],
        [
          "translation_word",
          [
            {
              "t": "sofa",
              "w": "沙发"
            }
          ],
          "sofas"
        ],
        [
          "translation_word",
          [
            {
              "t": "above",
              "w": "上"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "又"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          "under"
        ],
        [
          "translation_word",
          [
            {
              "t": "window",
              "w": "窗户"
            }
          ],
          "windows"
        ],
        [
          "translation_word",
          [
            {
              "t": "under",
              "w": "下边"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "pile_up",
              "w": "堆"
            },
            {
              "t": "succeed",
              "w": "成"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "small",
              "w": "小"
            },
            {
              "t": "pile_up",
              "w": "堆"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "small",
              "w": "小"
            }
          ],
          "little"
        ],
        [
          "translation_word",
          [
            {
              "t": "pile_up",
              "w": "堆"
            }
          ],
          "heaps"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "这里 是 德高望重 的 教授 迈克·维瑞斯－伊万 斯 ， 他 的 夫人 佩妮·伊万 斯－维瑞斯 ， 和 他们 的 养子 哈利 · 詹姆·波特 － 伊万斯－维瑞斯 家 的 客厅 。 ",
      "english_source": "<p>\n This is the living-room of the house occupied by the eminent\nProfessor Michael Verres-Evans, and his wife, Mrs. Petunia\nEvans-Verres, and their adopted son, Harry James\nPotter-Evans-Verres.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "here",
              "w": "这里"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "is"
        ],
        [
          "translation_word",
          [
            {
              "t": "a_person_of_virtue_and_prestige",
              "w": "德高望重"
            }
          ],
          "eminent"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "NAME?",
              "w": "迈克·维瑞斯－伊万"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "S",
              "w": "斯"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lady",
              "w": "夫人"
            }
          ],
          "wife"
        ],
        [
          "translation_word",
          [
            {
              "t": "Penny-Evans",
              "w": "佩妮·伊万"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "斯－维瑞斯"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "和"
            }
          ],
          "and"
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "their"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "adopted_son",
              "w": "养子"
            }
          ],
          "son"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "·",
              "w": "·"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "James_Potter",
              "w": "詹姆·波特"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "－"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "伊万斯－维瑞斯"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "home_;_family",
              "w": "家"
            }
          ],
          "house"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "living_room",
              "w": "客厅"
            }
          ],
          "living-room"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "客厅 的 桌子 上 放 着 一 封 信 ， 还有 一个 没 贴 邮票 的 黄色 羊皮纸 信封 ， 上面 用 翠绿 的 墨水 写 着 ： 收件人 ： H·波特 先生 。 ",
      "english_source": "<p>\n There is a letter lying on the living-room table, and an\nunstamped envelope of yellowish parchment, addressed to\n <em>\n  Mr. H.\nPotter\n </em>\n in emerald-green ink.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "living_room",
              "w": "客厅"
            }
          ],
          "living-room"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "table",
              "w": "桌子"
            }
          ],
          "table"
        ],
        [
          "translation_word",
          [
            {
              "t": "above",
              "w": "上"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "put",
              "w": "放"
            }
          ],
          "lying"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "grant",
              "w": "封"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "furthermore",
              "w": "还有"
            }
          ],
          "yellowish"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "an"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "没"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stick",
              "w": "贴"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stamp",
              "w": "邮票"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "yellow",
              "w": "黄色"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "parchment",
              "w": "羊皮纸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "envelope",
              "w": "信封"
            }
          ],
          "envelope"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "on_top_of",
              "w": "上面"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "greenish-blue",
              "w": "翠绿"
            }
          ],
          "emerald-green"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ink",
              "w": "墨水"
            }
          ],
          "ink"
        ],
        [
          "translation_word",
          [
            {
              "t": "write",
              "w": "写"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "："
        ],
        [
          "translation_word",
          [
            {
              "t": "recipient",
              "w": "收件人"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "："
        ],
        [
          "translation_word",
          [
            {
              "t": "H._Potter",
              "w": "H·波特"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Mister",
              "w": "先生"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "教授 正和 夫人 针锋相对 地 谈话 ， 不过 他们 都 没有 提高 声音 。 教授 认为 大喊大叫 是 缺乏 教养 的 表现 。 ",
      "english_source": "<p>\n The Professor and his wife are speaking sharply at each other,\nbut they are not shouting. The Professor considers shouting to be\nuncivilised.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "first_month_of_the_lunar_year",
              "w": "正"
            },
            {
              "t": "and",
              "w": "和"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lady",
              "w": "夫人"
            }
          ],
          "wife"
        ],
        [
          "translation_word",
          [
            {
              "t": "oppose_each_other_with_equal_harshness_;_tit_for_tat",
              "w": "针锋相对"
            }
          ],
          "each"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ly",
              "w": "地"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "talk",
              "w": "谈话"
            }
          ],
          "speaking"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "不过"
            }
          ],
          "but"
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "they"
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "都"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "haven't",
              "w": "没有"
            }
          ],
          "not"
        ],
        [
          "translation_word",
          [
            {
              "t": "raise",
              "w": "提高"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "voice",
              "w": "声音"
            }
          ],
          "shouting"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "believe",
              "w": "认为"
            }
          ],
          "considers"
        ],
        [
          "translation_word",
          [
            {
              "t": "shouting_and_screaming_;_to_scream_loudly",
              "w": "大喊大叫"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lack",
              "w": "缺乏"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "train",
              "w": "教养"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "show",
              "w": "表现"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 你 在 开玩笑 ， ” 迈克 对 佩妮 说 。 他 的 语气 表明 ， 他 非常 担心 她 并 不 是 在 开玩笑 。 ",
      "english_source": "<p>\n \"You're joking,\" Michael said to Petunia. His tone indicated\nthat he was very much afraid that she was serious.\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "'re"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "play_a_joke",
              "w": "开玩笑"
            }
          ],
          "joking"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "MI",
              "w": "迈"
            },
            {
              "t": "CHAEL",
              "w": "克"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "he"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "tone",
              "w": "语气"
            }
          ],
          "tone"
        ],
        [
          "translation_word",
          [
            {
              "t": "make_clear",
              "w": "表明"
            }
          ],
          "indicated"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "非常"
            }
          ],
          "very"
        ],
        [
          "translation_word",
          [
            {
              "t": "anxious",
              "w": "担心"
            }
          ],
          "afraid"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "she"
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "并"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "play_a_joke",
              "w": "开玩笑"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 我 妹妹 是 个 女巫 ， ” 佩妮 重复说 。 她 看 起来 很 害怕 ， 可 还 是 坚持 着 她 的 立场 。 “ 她 的 丈夫 是 个 巫师 。 ” ",
      "english_source": "<p>\n \"My sister was a witch,\" Petunia repeated. She looked\nfrightened, but stood her ground. \"Her husband was a wizard.\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "younger_sister",
              "w": "妹妹"
            }
          ],
          "sister"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "witch",
              "w": "女巫"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "repeat",
              "w": "重复"
            },
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "her"
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          "looked"
        ],
        [
          "translation_word",
          [
            {
              "t": "stand_up",
              "w": "起来"
            }
          ],
          "stood"
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "be_afraid",
              "w": "害怕"
            }
          ],
          "frightened"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persevere_with",
              "w": "坚持"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "position",
              "w": "立场"
            }
          ],
          "ground"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "husband",
              "w": "丈夫"
            }
          ],
          "husband"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "wizard",
              "w": "巫师"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 荒唐 ！ ” 迈克 尖锐 地 指出 ， “ 他们 参加 了 我们 的 婚礼 —— 还有 圣诞节 也 来过 —— \" ",
      "english_source": "<p>\n \"This is absurd!\" Michael said sharply. \"They were at our\nwedding - they visited for Christmas -\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "beyond_belief",
              "w": "荒唐"
            }
          ],
          "absurd"
        ],
        [
          "punctuation",
          "！"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "MI",
              "w": "迈"
            },
            {
              "t": "CHAEL",
              "w": "克"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "sharp",
              "w": "尖锐"
            }
          ],
          "sharply"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ly",
              "w": "地"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "indicate",
              "w": "指出"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "they"
        ],
        [
          "translation_word",
          [
            {
              "t": "participate",
              "w": "参加"
            }
          ],
          "at"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "we",
              "w": "我们"
            }
          ],
          "our"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "wedding_ceremony",
              "w": "婚礼"
            }
          ],
          "wedding"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "translation_word",
          [
            {
              "t": "furthermore",
              "w": "还有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Christmas_time",
              "w": "圣诞节"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            },
            {
              "t": "PAST",
              "w": "过"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "\""
            }
          ],
          ""
        ]
      ]
    },
    {
      "chinese_source": "“ 我 让 他们 别 告诉 你 ， ” 佩妮 小声 说 ， “ 但是 这 是 真 的 。 我 见 过 —— ” ",
      "english_source": "<p>\n \"I told them you weren't to know,\" Petunia whispered. \"But it's\ntrue. I've seen things -\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "yield",
              "w": "让"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "them"
        ],
        [
          "translation_word",
          [
            {
              "t": "don't!",
              "w": "别"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "tell",
              "w": "告诉"
            }
          ],
          "told"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "in_a_low_voice",
              "w": "小声"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "但是"
            }
          ],
          "it"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "really",
              "w": "真"
            }
          ],
          "true"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "see",
              "w": "见"
            }
          ],
          "seen"
        ],
        [
          "translation_word",
          [
            {
              "t": "PAST",
              "w": "过"
            }
          ],
          "'ve"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "教授 翻 了 翻 眼睛 。 “ 亲爱 的 ， 我 理解 你 ， 你 对 怀疑主义 的 文献 还 不 熟悉 。 你 恐怕 不 知道 ， 一个 专业 的 魔术师 轻而易举 就 能 做到 看 起来 不 可能 的 事 。 你 还 记得 我 是 怎么 教 哈利 弄弯 勺子 的 吗 ？ 如果 他们 貌似 能 看穿 你 的 思想 的 话 ， 那种 技巧 有 个 名字 ， 叫 冷 分析 —— ” ",
      "english_source": "<p>\n The Professor rolled his eyes. \"Dear, I understand that you're\nnot familiar with the sceptical literature. You may not realise how\neasy it is for a trained magician to fake the seemingly impossible.\nRemember how I taught Harry to bend spoons? If it seemed like they\ncould always guess what you were thinking, that's called cold\nreading -\"\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "turn_over",
              "w": "翻"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "turn_over",
              "w": "翻"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "eye",
              "w": "眼睛"
            }
          ],
          "eyes"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "dear",
              "w": "亲爱"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "comprehend",
              "w": "理解"
            }
          ],
          "understand"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "'re"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "doubt",
              "w": "怀疑"
            },
            {
              "t": "-ism",
              "w": "主义"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "document",
              "w": "文献"
            }
          ],
          "literature"
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "not"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_familiar_with",
              "w": "熟悉"
            }
          ],
          "familiar"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "fear",
              "w": "恐怕"
            }
          ],
          "may"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "know",
              "w": "知道"
            }
          ],
          "realise"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "specialty",
              "w": "专业"
            }
          ],
          "trained"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "magician",
              "w": "魔术师"
            }
          ],
          "magician"
        ],
        [
          "translation_word",
          [
            {
              "t": "easy",
              "w": "轻而易举"
            }
          ],
          "easy"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "能"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "accomplish",
              "w": "做到"
            }
          ],
          "impossible"
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stand_up",
              "w": "起来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "might",
              "w": "可能"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "matter",
              "w": "事"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "remember",
              "w": "记得"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "how?",
              "w": "怎么"
            }
          ],
          "how"
        ],
        [
          "translation_word",
          [
            {
              "t": "teach",
              "w": "教"
            }
          ],
          "taught"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lane",
              "w": "弄"
            },
            {
              "t": "bend",
              "w": "弯"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "scoop",
              "w": "勺子"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "see_嗎啡|吗啡,_morphine",
              "w": "吗"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          "it"
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "they"
        ],
        [
          "translation_word",
          [
            {
              "t": "appear_to_be",
              "w": "貌似"
            }
          ],
          "seemingly"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "能"
            }
          ],
          "could"
        ],
        [
          "translation_word",
          [
            {
              "t": "see_through",
              "w": "看穿"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "thought",
              "w": "思想"
            }
          ],
          "thinking"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          "'s"
        ],
        [
          "translation_word",
          [
            {
              "t": "dialect",
              "w": "话"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "that",
              "w": "那种"
            }
          ],
          "what"
        ],
        [
          "translation_word",
          [
            {
              "t": "skill",
              "w": "技巧"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "name",
              "w": "名字"
            }
          ],
          "called"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "shout",
              "w": "叫"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "cold",
              "w": "冷"
            }
          ],
          "cold"
        ],
        [
          "translation_word",
          [
            {
              "t": "analyze",
              "w": "分析"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 不 是 弄弯 勺子 这种 事 —— ” ",
      "english_source": "<p>\n \"It wasn't bending spoons -\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "lane",
              "w": "弄"
            },
            {
              "t": "bend",
              "w": "弯"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "scoop",
              "w": "勺子"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这种"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "matter",
              "w": "事"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 那 是 什么 呢 ？ ” ",
      "english_source": "<p>\n \"What was it, then?\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "that",
              "w": "那"
            }
          ],
          "then"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "what?",
              "w": "什么"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "particle_indicating_that_a_previously_asked_question_is_to_be_applied_to_the_preceding_word",
              "w": "呢"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "佩妮 咬着 嘴唇 。 “ 我 没 办法 对 你 说 。 你 会 觉得 我 —— ” 她 咽 了 一下 口水 ， “ 听 我 说 ， 迈克 。 我 不 是 —— 一直 像 现在 这样 —— ” 她 指 了 指 自己 ， 好像 在 指出 自己 优美 的 曲线 ， “ 这 是 莉莉 做 的 。 因为 我 － 因为 我 求 她 的 。 我 求 了 她 很 多年 。 莉莉 一直 比 我 美 ， 我 …… 我 因为 这个 一直 对 她 很 凶 。 然后 她 还 会 魔法 ， 你 能 想象 我 的 感受 吗 ？ 我 求 她 用 她 的 魔法 把 我 也 变美 ， 如果 我 不 能 有 魔法 的 话 ， 至少 让 我 变美 吧 。 ” ",
      "english_source": "<p>\n Petunia bit her lip. \"I can't just tell you. You'll think I'm -\"\nShe swallowed. \"Listen. Michael. I wasn't - always like this -\" She\ngestured at herself, as though to indicate her lithe form. \"Lily\ndid this. Because I - because I\n <em>\n  begged\n </em>\n her. For years, I\nbegged her. Lily had\n <em>\n  always\n </em>\n been prettier than me, and\nI'd... been mean to her, because of that, and then she got\n <em>\n  magic,\n </em>\n can you imagine how I felt? And I\n <em>\n  begged\n </em>\n her to use some of that magic on me so that I could be pretty too,\neven if I couldn't have her magic, at least I could be pretty.\"\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "bite",
              "w": "咬"
            },
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lip",
              "w": "嘴唇"
            }
          ],
          "lip"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "没"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "means",
              "w": "办法"
            }
          ],
          "ca"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "'ll"
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "tell"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "觉得"
            }
          ],
          "think"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "she"
        ],
        [
          "translation_word",
          [
            {
              "t": "narrow_pass",
              "w": "咽"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "give_it_a_go",
              "w": "一下"
            }
          ],
          "bit"
        ],
        [
          "translation_word",
          [
            {
              "t": "saliva",
              "w": "口水"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "smile",
              "w": "听"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "MI",
              "w": "迈"
            },
            {
              "t": "CHAEL",
              "w": "克"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "straight",
              "w": "一直"
            }
          ],
          "always"
        ],
        [
          "translation_word",
          [
            {
              "t": "resemble",
              "w": "像"
            }
          ],
          "like"
        ],
        [
          "translation_word",
          [
            {
              "t": "now",
              "w": "现在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this_kind_of",
              "w": "这样"
            }
          ],
          "this"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "herself"
        ],
        [
          "translation_word",
          [
            {
              "t": "finger",
              "w": "指"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "finger",
              "w": "指"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          "her"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "as_if",
              "w": "好像"
            }
          ],
          "though"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "indicate",
              "w": "指出"
            }
          ],
          "indicate"
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "graceful",
              "w": "优美"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "curve",
              "w": "曲线"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "LI",
              "w": "莉"
            },
            {
              "t": "LI",
              "w": "莉"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "do",
              "w": "做"
            }
          ],
          "did"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "because",
              "w": "因为"
            }
          ],
          "because"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "－"
        ],
        [
          "translation_word",
          [
            {
              "t": "because",
              "w": "因为"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "seek",
              "w": "求"
            }
          ],
          "begged"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "seek",
              "w": "求"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "many",
              "w": "多"
            },
            {
              "t": "year",
              "w": "年"
            }
          ],
          "years"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "LI",
              "w": "莉"
            },
            {
              "t": "LI",
              "w": "莉"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "straight",
              "w": "一直"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "compared_to",
              "w": "比"
            }
          ],
          "than"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "the_Americas",
              "w": "美"
            }
          ],
          "prettier"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "me"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "……"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "because",
              "w": "因为"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "straight",
              "w": "一直"
            }
          ],
          "been"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "terrible",
              "w": "凶"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "after",
              "w": "然后"
            }
          ],
          "then"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          "got"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "能"
            }
          ],
          "can"
        ],
        [
          "translation_word",
          [
            {
              "t": "imagine",
              "w": "想象"
            }
          ],
          "imagine"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "sense",
              "w": "感受"
            }
          ],
          "felt"
        ],
        [
          "translation_word",
          [
            {
              "t": "see_嗎啡|吗啡,_morphine",
              "w": "吗"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "seek",
              "w": "求"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            }
          ],
          "use"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          "too"
        ],
        [
          "translation_word",
          [
            {
              "t": "change",
              "w": "变"
            },
            {
              "t": "the_Americas",
              "w": "美"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          "if"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "能"
            }
          ],
          "could"
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          "have"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "dialect",
              "w": "话"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_least",
              "w": "至少"
            }
          ],
          "least"
        ],
        [
          "translation_word",
          [
            {
              "t": "yield",
              "w": "让"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "change",
              "w": "变"
            },
            {
              "t": "the_Americas",
              "w": "美"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "bar",
              "w": "吧"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "佩妮 的 眼里 蓄 满 了 泪珠 。 ",
      "english_source": "<p>\n Tears were gathering in Petunia's eyes.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "eye",
              "w": "眼"
            },
            {
              "t": "lining",
              "w": "里"
            }
          ],
          "eyes"
        ],
        [
          "translation_word",
          [
            {
              "t": "store_up",
              "w": "蓄"
            }
          ],
          "gathering"
        ],
        [
          "translation_word",
          [
            {
              "t": "fill",
              "w": "满"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "a_teardrop",
              "w": "泪珠"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 莉莉 一直 不 同意 ， 她 编了 很多 可笑 的 理由 ， 什么 对 姐姐 好 一 点 就 会 引发 世界 末日 啦 ， 有 个 半人马 警告 她 不 可以 啦 － 最最 荒唐 的 理由 ， 我 恨死 她 了 。 后来 我 大学 毕业 了 ， 开始 和 一个 名叫 威农·德思 礼 的 男孩子 约会 ， 他 很 胖 ， 但是 他 是 唯一 一个 肯 和 我 说话 的 男 孩子 。 然后 他 说 他 想 要 孩子 ， 他 的 大儿子 的 名字 要 叫做 达 力 。 我 想 ， 什么样 的 父母 才 会 给 自己 的 孩子 起名 叫 达力·德思 礼 啊 ？ 我 在 那 一刻 清清楚楚 地 看到 我 的 将来 ， 我 再 也 受不了 了 。 我 给 妹妹 写信 ， 对 她 说 如果 她 不 肯 帮 我 的 话 ， 我 就 去 —— ” ",
      "english_source": "<p>\n \"And Lily would tell me no, and make up the most ridiculous\nexcuses, like the world would end if she were nice to her sister,\nor a centaur told her not to - the most ridiculous things, and I\nhated her for it. And when I had just graduated from university, I\nwas going out with this boy, Vernon Dursley, he was fat and he was\nthe only boy who would talk to me. And he said he wanted children,\nand that his first son would be named Dudley. And I thought to\nmyself,\n <em>\n  what kind of parent names their child Dudley\nDursley?\n </em>\n It was like I saw my whole future life stretching out\nin front of me, and I couldn't stand it. And I wrote to my sister\nand told her that if she didn't help me I'd rather just -\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "LI",
              "w": "莉"
            },
            {
              "t": "LI",
              "w": "莉"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "straight",
              "w": "一直"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "no"
        ],
        [
          "translation_word",
          [
            {
              "t": "agree",
              "w": "同意"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "her"
        ],
        [
          "translation_word",
          [
            {
              "t": "weave",
              "w": "编"
            },
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            },
            {
              "t": "many",
              "w": "多"
            }
          ],
          "most"
        ],
        [
          "translation_word",
          [
            {
              "t": "funny",
              "w": "可笑"
            }
          ],
          "ridiculous"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "reason",
              "w": "理由"
            }
          ],
          "excuses"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "what?",
              "w": "什么"
            }
          ],
          "tell"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          "told"
        ],
        [
          "translation_word",
          [
            {
              "t": "older_sister",
              "w": "姐姐"
            }
          ],
          "sister"
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          "nice"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "point",
              "w": "点"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          "would"
        ],
        [
          "translation_word",
          [
            {
              "t": "lead_to",
              "w": "引发"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "world",
              "w": "世界"
            }
          ],
          "world"
        ],
        [
          "translation_word",
          [
            {
              "t": "Judgment_Day",
              "w": "末日"
            }
          ],
          "end"
        ],
        [
          "translation_word",
          [
            {
              "t": "exclamation",
              "w": "啦"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "centaur",
              "w": "半人马"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "warn",
              "w": "警告"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "she"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "not"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "exclamation",
              "w": "啦"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "－"
        ],
        [
          "translation_word",
          [
            {
              "t": "most",
              "w": "最"
            },
            {
              "t": "most",
              "w": "最"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "beyond_belief",
              "w": "荒唐"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "reason",
              "w": "理由"
            }
          ],
          "for"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hate",
              "w": "恨"
            },
            {
              "t": "die",
              "w": "死"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "afterwards",
              "w": "后来"
            }
          ],
          "when"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "the_Great_Learning,_one_of_the_Four_Books_四書|四书[Si4_shu1]_in_Confucianism",
              "w": "大学"
            }
          ],
          "university"
        ],
        [
          "translation_word",
          [
            {
              "t": "graduation",
              "w": "毕业"
            }
          ],
          "graduated"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "begin",
              "w": "开始"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "和"
            }
          ],
          "and"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "called",
              "w": "名叫"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Vernon_Dursley",
              "w": "威农·德思"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "LEY",
              "w": "礼"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "boy",
              "w": "男孩子"
            }
          ],
          "boy"
        ],
        [
          "translation_word",
          [
            {
              "t": "appointment",
              "w": "约会"
            }
          ],
          "going"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "he"
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "healthy",
              "w": "胖"
            }
          ],
          "fat"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "但是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "唯一"
            }
          ],
          "only"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "agree",
              "w": "肯"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "和"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "me"
        ],
        [
          "translation_word",
          [
            {
              "t": "speak",
              "w": "说话"
            }
          ],
          "talk"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "male",
              "w": "男"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "child",
              "w": "孩子"
            }
          ],
          "children"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "after",
              "w": "然后"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "wanted"
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "child",
              "w": "孩子"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "big",
              "w": "大"
            },
            {
              "t": "son",
              "w": "儿子"
            }
          ],
          "son"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "name",
              "w": "名字"
            }
          ],
          "names"
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "be_called",
              "w": "叫做"
            }
          ],
          "named"
        ],
        [
          "translation_word",
          [
            {
              "t": "attain",
              "w": "达"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "power",
              "w": "力"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "thought"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "what_kind?",
              "w": "什么样"
            }
          ],
          "kind"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "father_and_mother",
              "w": "父母"
            }
          ],
          "parent"
        ],
        [
          "translation_word",
          [
            {
              "t": "ability",
              "w": "才"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "to",
              "w": "给"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          "myself"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "child",
              "w": "孩子"
            }
          ],
          "child"
        ],
        [
          "translation_word",
          [
            {
              "t": "name",
              "w": "起名"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "shout",
              "w": "叫"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Dudley_Dursley",
              "w": "达力·德思"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "LEY",
              "w": "礼"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "interjection_of_surprise",
              "w": "啊"
            }
          ],
          "n't"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "my"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "that",
              "w": "那"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "quarter",
              "w": "刻"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "清清楚楚"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "-ly",
              "w": "地"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "看到"
            }
          ],
          "saw"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "in_the_future",
              "w": "将来"
            }
          ],
          "future"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "再"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "unbearable",
              "w": "受不了"
            }
          ],
          "stand"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "to",
              "w": "给"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "younger_sister",
              "w": "妹妹"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "write_a_letter",
              "w": "写信"
            }
          ],
          "wrote"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          "if"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "agree",
              "w": "肯"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "help",
              "w": "帮"
            }
          ],
          "help"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "dialect",
              "w": "话"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          "'d"
        ],
        [
          "translation_word",
          [
            {
              "t": "go",
              "w": "去"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "佩妮 停住 了 。 ",
      "english_source": "<p>\n Petunia stopped.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stop",
              "w": "停住"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 总而言之 ， ” 佩妮 小声 说 ， “ 她 屈服 了 。 她 告诉 我 说 很 危险 ， 我 说 我 不在乎 。 我 喝 下 她 的 魔法 药水 ， 生 了 几 个 星期 的 病 ， 病 好 的 时候 ， 我 的 粉刺 没有 了 ， 身材 变 好 了 ， 而且 …… 我 变成 美女 了 ， 大家 开始 对 我 很 好 。 ” 她 的 声音哽咽 了 ， “ 从 那 以后 我 对 妹妹 再 也 恨 不 起来 了 ， 何况 后来 又 看到 了 她 的 魔法 带 给 她 的 结局 —— ” ",
      "english_source": "<p>\n \"Anyway,\" Petunia said, her voice small, \"she gave in. She told\nme it was dangerous, and I said I didn't care any more, and I drank\nthis potion and I was sick for weeks, but when I got better my skin\ncleared up and I finally filled out and... I was beautiful, people\nwere\n <em>\n  nice\n </em>\n to me,\" her voice broke, \"and after that I\ncouldn't hate my sister any more, especially when I learned what\nher magic brought her in the end -\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "in_short",
              "w": "总而言之"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "in_a_low_voice",
              "w": "小声"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "her"
        ],
        [
          "translation_word",
          [
            {
              "t": "surrender",
              "w": "屈服"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          "gave"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "she"
        ],
        [
          "translation_word",
          [
            {
              "t": "tell",
              "w": "告诉"
            }
          ],
          "told"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "me"
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "danger",
              "w": "危险"
            }
          ],
          "dangerous"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not_to_care",
              "w": "不在乎"
            }
          ],
          "care"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "drink",
              "w": "喝"
            }
          ],
          "drank"
        ],
        [
          "translation_word",
          [
            {
              "t": "down",
              "w": "下"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Yaksu_in_North_Korea,_near_the_border_with_Liaoning_and_Jiling_province",
              "w": "药水"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_born",
              "w": "生"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "small_table",
              "w": "几"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "week",
              "w": "星期"
            }
          ],
          "weeks"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "illness",
              "w": "病"
            }
          ],
          "sick"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "illness",
              "w": "病"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          "better"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "time",
              "w": "时候"
            }
          ],
          "when"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "my"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "pimple",
              "w": "粉刺"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "haven't",
              "w": "没有"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          "got"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "stature",
              "w": "身材"
            }
          ],
          "beautiful"
        ],
        [
          "translation_word",
          [
            {
              "t": "change",
              "w": "变"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but_also",
              "w": "而且"
            }
          ],
          "but"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "……"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "change_into",
              "w": "变成"
            }
          ],
          "broke"
        ],
        [
          "translation_word",
          [
            {
              "t": "beautiful_woman",
              "w": "美女"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "everyone",
              "w": "大家"
            }
          ],
          "people"
        ],
        [
          "translation_word",
          [
            {
              "t": "begin",
              "w": "开始"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          "nice"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "voice",
              "w": "声音"
            },
            {
              "t": "choke_with_emotion",
              "w": "哽咽"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "from",
              "w": "从"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "that",
              "w": "那"
            }
          ],
          "that"
        ],
        [
          "translation_word",
          [
            {
              "t": "after",
              "w": "以后"
            }
          ],
          "after"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "younger_sister",
              "w": "妹妹"
            }
          ],
          "sister"
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "再"
            }
          ],
          "more"
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hate",
              "w": "恨"
            }
          ],
          "hate"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stand_up",
              "w": "起来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "let_alone",
              "w": "何况"
            }
          ],
          "especially"
        ],
        [
          "translation_word",
          [
            {
              "t": "afterwards",
              "w": "后来"
            }
          ],
          "learned"
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "又"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "看到"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "translation_word",
          [
            {
              "t": "band",
              "w": "带"
            }
          ],
          "brought"
        ],
        [
          "translation_word",
          [
            {
              "t": "to",
              "w": "给"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "conclusion",
              "w": "结局"
            }
          ],
          "end"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 亲爱 的 ， ” 迈克 温柔 地 说 ， “ 你 生病 了 ， 因为 卧床 的 缘故 丰满 了 一些 ， 然后 你 的 皮肤 自己 变 好 了 。 也 可能 你 在 生病 的 时候 改变 了 饮食 习惯 —— ” ",
      "english_source": "<p>\n \"Darling,\" Michael said gently, \"you got sick, you gained some\nweight while resting in bed, and your skin cleared up on its own.\nOr being sick made you change your diet -\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "dear",
              "w": "亲爱"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "MI",
              "w": "迈"
            },
            {
              "t": "CHAEL",
              "w": "克"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "gentle_and_soft",
              "w": "温柔"
            }
          ],
          "gently"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ly",
              "w": "地"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "fall_ill",
              "w": "生病"
            }
          ],
          "sick"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          "gained"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "because",
              "w": "因为"
            }
          ],
          "while"
        ],
        [
          "translation_word",
          [
            {
              "t": "lie_in_bed",
              "w": "卧床"
            }
          ],
          "bed"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "reason",
              "w": "缘故"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Fengman_district_of_Jilin_city_吉林市,_Jilin_province",
              "w": "丰满"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          "got"
        ],
        [
          "translation_word",
          [
            {
              "t": "some",
              "w": "一些"
            }
          ],
          "some"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "after",
              "w": "然后"
            }
          ],
          "and"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "your"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "skin",
              "w": "皮肤"
            }
          ],
          "skin"
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          "own"
        ],
        [
          "translation_word",
          [
            {
              "t": "change",
              "w": "变"
            }
          ],
          "change"
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "might",
              "w": "可能"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "fall_ill",
              "w": "生病"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "time",
              "w": "时候"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "change",
              "w": "改变"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "food_and_drink",
              "w": "饮食"
            }
          ],
          "diet"
        ],
        [
          "translation_word",
          [
            {
              "t": "habit",
              "w": "习惯"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 她 是 女巫 ， ” 佩妮 重复 道 ， “ 我 亲眼 见 过 的 。 ” ",
      "english_source": "<p>\n \"She was a witch,\" Petunia repeated. \"I saw it.\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "witch",
              "w": "女巫"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "repeat",
              "w": "重复"
            }
          ],
          "repeated"
        ],
        [
          "translation_word",
          [
            {
              "t": "road",
              "w": "道"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "with_one's_own_eyes",
              "w": "亲眼"
            }
          ],
          "saw"
        ],
        [
          "translation_word",
          [
            {
              "t": "see",
              "w": "见"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "PAST",
              "w": "过"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 佩妮 ， ” 迈克 说道 ， 他 的 声音 渐渐 变 得 不耐烦 ， “ 你 明 知道 那 是 不 可能 的 。 一定 要 我 解释 为什么 吗 ？ ” ",
      "english_source": "<p>\n \"Petunia,\" Michael said. The annoyance was creeping into his\nvoice. \"You\n <em>\n  know\n </em>\n that can't be true. Do I really have to\nexplain why?\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "MI",
              "w": "迈"
            },
            {
              "t": "CHAEL",
              "w": "克"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "state",
              "w": "说道"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "voice",
              "w": "声音"
            }
          ],
          "voice"
        ],
        [
          "translation_word",
          [
            {
              "t": "gradually",
              "w": "渐渐"
            }
          ],
          "creeping"
        ],
        [
          "translation_word",
          [
            {
              "t": "change",
              "w": "变"
            }
          ],
          "into"
        ],
        [
          "translation_word",
          [
            {
              "t": "obtain",
              "w": "得"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "impatience",
              "w": "不耐烦"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Ming_Dynasty",
              "w": "明"
            }
          ],
          "that"
        ],
        [
          "translation_word",
          [
            {
              "t": "know",
              "w": "知道"
            }
          ],
          "know"
        ],
        [
          "translation_word",
          [
            {
              "t": "that",
              "w": "那"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "might",
              "w": "可能"
            }
          ],
          "be"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "surely",
              "w": "一定"
            }
          ],
          "really"
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          "to"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "explanation",
              "w": "解释"
            }
          ],
          "explain"
        ],
        [
          "translation_word",
          [
            {
              "t": "why?",
              "w": "为什么"
            }
          ],
          "why"
        ],
        [
          "translation_word",
          [
            {
              "t": "see_嗎啡|吗啡,_morphine",
              "w": "吗"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "佩妮绞 着 双手 ， 看 起来 快要 哭 出来 了 。 “ 亲爱的 ， 我 知道 我 说 不 过 你 ， 可是 这 件 事 你 一定 要 相信 我 —— ” ",
      "english_source": "<p>\n Petunia wrung her hands. She seemed to be on the verge of tears.\n\"My love, I know I can't win arguments with you, but please, you\nhave to trust me on this -\"\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            },
            {
              "t": "twist",
              "w": "绞"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          "her"
        ],
        [
          "translation_word",
          [
            {
              "t": "both_hands",
              "w": "双手"
            }
          ],
          "hands"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stand_up",
              "w": "起来"
            }
          ],
          "seemed"
        ],
        [
          "translation_word",
          [
            {
              "t": "almost",
              "w": "快要"
            }
          ],
          "verge"
        ],
        [
          "translation_word",
          [
            {
              "t": "cry",
              "w": "哭"
            }
          ],
          "tears"
        ],
        [
          "translation_word",
          [
            {
              "t": "come_out",
              "w": "出来"
            }
          ],
          "ca"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "dear",
              "w": "亲爱"
            },
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "know",
              "w": "知道"
            }
          ],
          "know"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "PAST",
              "w": "过"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          "but"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          "this"
        ],
        [
          "translation_word",
          [
            {
              "t": "item",
              "w": "件"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "matter",
              "w": "事"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "surely",
              "w": "一定"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "be_convinced",
              "w": "相信"
            }
          ],
          "trust"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "me"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 爸爸 ！ 妈妈 ！ ” ",
      "english_source": "<p>\n \"\n <em>\n  Dad! Mum!\n </em>\n \"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "！"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "！"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "两 人 停下来 看 着 哈利 ， 就 像 刚刚 才 想起 屋子 里 还 有 第三 个 人 。 ",
      "english_source": "<p>\n The two of them stopped and looked at Harry as though they'd\nforgotten there was a third person in the room.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "two",
              "w": "两"
            }
          ],
          "two"
        ],
        [
          "translation_word",
          [
            {
              "t": "man",
              "w": "人"
            }
          ],
          "them"
        ],
        [
          "translation_word",
          [
            {
              "t": "stop",
              "w": "停下来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          "looked"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          "'d"
        ],
        [
          "translation_word",
          [
            {
              "t": "resemble",
              "w": "像"
            }
          ],
          "as"
        ],
        [
          "translation_word",
          [
            {
              "t": "just_recently",
              "w": "刚刚"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ability",
              "w": "才"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "recall",
              "w": "想起"
            }
          ],
          "there"
        ],
        [
          "translation_word",
          [
            {
              "t": "house",
              "w": "屋子"
            }
          ],
          "room"
        ],
        [
          "translation_word",
          [
            {
              "t": "lining",
              "w": "里"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "第三"
            }
          ],
          "third"
        ],
        [
          "translation_word",
          [
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "man",
              "w": "人"
            }
          ],
          "person"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "哈利 深 吸 了 一 口 气 。 “ 妈妈 ， 你 的 父母 也 不 会 魔法 ， 对 不对 ？ ” ",
      "english_source": "<p>\n Harry took a deep breath. \"Mum,\n <em>\n  your\n </em>\n parents didn't\nhave magic, did they?\"\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "deep",
              "w": "深"
            }
          ],
          "deep"
        ],
        [
          "translation_word",
          [
            {
              "t": "breathe",
              "w": "吸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          "took"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mouth",
              "w": "口"
            }
          ],
          "breath"
        ],
        [
          "translation_word",
          [
            {
              "t": "gas",
              "w": "气"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          "parents"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "your"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "father_and_mother",
              "w": "父母"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "did"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "incorrect",
              "w": "不对"
            }
          ],
          "n't"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 是 不 会 ， ” 佩妮 说 ， 看 起来 有 点 莫名其妙 。 ",
      "english_source": "<p>\n \"No,\" Petunia said, looking puzzled.\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          "looking"
        ],
        [
          "translation_word",
          [
            {
              "t": "stand_up",
              "w": "起来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "point",
              "w": "点"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "unfathomable_mystery_;_subtle_and_ineffable",
              "w": "莫名其妙"
            }
          ],
          "puzzled"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 那么 莉莉 拿 到 她 的 信 的 时候 ， 你们 家 也 没有 人 知道 魔法 的 存在 。 他们 是 怎么 相信 的 呢 ？ ” ",
      "english_source": "<p>\n \"Then no one in your family knew about magic when Lily got her\nletter. How did\n <em>\n  they\n </em>\n get convinced?\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "like_that",
              "w": "那么"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "LI",
              "w": "莉"
            },
            {
              "t": "LI",
              "w": "莉"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "拿"
            }
          ],
          "got"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "到"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "her"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "time",
              "w": "时候"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你们"
            }
          ],
          "your"
        ],
        [
          "translation_word",
          [
            {
              "t": "home_;_family",
              "w": "家"
            }
          ],
          "family"
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "haven't",
              "w": "没有"
            }
          ],
          "no"
        ],
        [
          "translation_word",
          [
            {
              "t": "man",
              "w": "人"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "know",
              "w": "知道"
            }
          ],
          "knew"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "exist",
              "w": "存在"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "they"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "how?",
              "w": "怎么"
            }
          ],
          "did"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_convinced",
              "w": "相信"
            }
          ],
          "convinced"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "particle_indicating_that_a_previously_asked_question_is_to_be_applied_to_the_preceding_word",
              "w": "呢"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 啊 …… \"佩妮 说 ， “ 他们 不止 是 送 了 信 来 。 还 来 了 一个 霍 格沃茨 的 教授 。 他 —— ” 佩妮瞥 了 一 眼 迈克 ， “ 他 给 我们 表演 了 一些 魔法 。 ” ",
      "english_source": "<p>\n \"Ah...\" Petunia said. \"They didn't just send a letter. They sent\na professor from Hogwarts. He -\" Petunia's eyes flicked to Michael.\n\"He showed us some magic.\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "interjection_of_surprise",
              "w": "啊"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "……"
            }
          ],
          "."
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "\"佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "incessantly",
              "w": "不止"
            }
          ],
          "just"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "deliver",
              "w": "送"
            }
          ],
          "send"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            }
          ],
          "professor"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            },
            {
              "t": "shoot_a_glance",
              "w": "瞥"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "eye",
              "w": "眼"
            }
          ],
          "eyes"
        ],
        [
          "translation_word",
          [
            {
              "t": "MI",
              "w": "迈"
            },
            {
              "t": "CHAEL",
              "w": "克"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "to",
              "w": "给"
            }
          ],
          "sent"
        ],
        [
          "translation_word",
          [
            {
              "t": "we",
              "w": "我们"
            }
          ],
          "us"
        ],
        [
          "translation_word",
          [
            {
              "t": "play",
              "w": "表演"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "some",
              "w": "一些"
            }
          ],
          "some"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 那 你们 就 不 用 吵 了 ， ” 哈利 坚决 地 说 ， 暗自 希望 这 一 次 ， 哪怕 就 一 次 ， 他们 能 偶然 听听 他 的 意见 。 “ 如果 这 件 事 是 真的 的 话 ， 我们 也 可以 请 一个 霍 格沃茨 的 教授 过来 ， 亲眼 见证 魔法 的 存在 ， 爸爸 就 会 承认 这 是 真 的 了 。 如果 不 成 ， 妈妈 就 承认 这 是 假 的 。 实验 的 方法 的 用处 就 是 这个 ， 让 我们 不用 争论 也 可以 解决 问题 。 ” ",
      "english_source": "<p>\n \"Then you don't have to fight over this,\" Harry said firmly.\nHoping against hope that this time, just this once, they would\nlisten to him. \"If it's true, we can just get a Hogwarts professor\nhere and see the magic for ourselves, and Dad will admit that it's\ntrue. And if not, then Mum will admit that it's false. That's what\nthe experimental method is for, so that we don't have to resolve\nthings just by arguing.\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "that",
              "w": "那"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你们"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "quarrel",
              "w": "吵"
            }
          ],
          "fight"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "firm",
              "w": "坚决"
            }
          ],
          "firmly"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ly",
              "w": "地"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "inwardly",
              "w": "暗自"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "wish_for",
              "w": "希望"
            }
          ],
          "hope"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          "this"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "next_in_sequence",
              "w": "次"
            }
          ],
          "time"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "even",
              "w": "哪怕"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          "just"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "next_in_sequence",
              "w": "次"
            }
          ],
          "once"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "they"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "能"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "incidentally",
              "w": "偶然"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "smile",
              "w": "听"
            },
            {
              "t": "smile",
              "w": "听"
            }
          ],
          "listen"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "him"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "idea",
              "w": "意见"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          "if"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          "it"
        ],
        [
          "translation_word",
          [
            {
              "t": "item",
              "w": "件"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "matter",
              "w": "事"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "really",
              "w": "真"
            },
            {
              "t": "of",
              "w": "的"
            }
          ],
          "true"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "dialect",
              "w": "话"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "we",
              "w": "我们"
            }
          ],
          "we"
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          "can"
        ],
        [
          "translation_word",
          [
            {
              "t": "ask",
              "w": "请"
            }
          ],
          "get"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            }
          ],
          "professor"
        ],
        [
          "translation_word",
          [
            {
              "t": "come_over",
              "w": "过来"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "with_one's_own_eyes",
              "w": "亲眼"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "be_witness_to",
              "w": "见证"
            }
          ],
          "see"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "exist",
              "w": "存在"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          "will"
        ],
        [
          "translation_word",
          [
            {
              "t": "admit",
              "w": "承认"
            }
          ],
          "admit"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "really",
              "w": "真"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "not"
        ],
        [
          "translation_word",
          [
            {
              "t": "succeed",
              "w": "成"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          "then"
        ],
        [
          "translation_word",
          [
            {
              "t": "admit",
              "w": "承认"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "fake",
              "w": "假"
            }
          ],
          "false"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          "'s"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "experiment",
              "w": "实验"
            }
          ],
          "experimental"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "method",
              "w": "方法"
            }
          ],
          "method"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "usefulness",
              "w": "用处"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "is"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这个"
            }
          ],
          "that"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "yield",
              "w": "让"
            }
          ],
          "so"
        ],
        [
          "translation_word",
          [
            {
              "t": "we",
              "w": "我们"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "need_not",
              "w": "不用"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "argue",
              "w": "争论"
            }
          ],
          "arguing"
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "settle",
              "w": "解决"
            }
          ],
          "resolve"
        ],
        [
          "translation_word",
          [
            {
              "t": "question",
              "w": "问题"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "教授 转 过 身 来 低头 看 他 ， 和 平常 一样 不屑一顾 。 “ 得啦 ， 哈利 。 真 的 假 的 ， 还 魔法 ？ 我 本来 还 期望 你 不至于 对 这种 事情 也 认真 呢 ， 儿子 ， 即使 你 才 十 岁 。 魔法 可以 说 是 世上 最 反科学 的 事情 了 ！ ” ",
      "english_source": "<p>\n The Professor turned and looked down at him, dismissive as\nusual. \"Oh, come now, Harry. Really,\n <em>\n  magic?\n </em>\n I thought\n <em>\n  you'd\n </em>\n know better than to take this seriously, son, even\nif you're only ten. Magic is just about the most unscientific thing\nthere is!\"\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "see_轉文|转文[zhuai3_wen2]",
              "w": "转"
            }
          ],
          "turned"
        ],
        [
          "translation_word",
          [
            {
              "t": "PAST",
              "w": "过"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "body",
              "w": "身"
            }
          ],
          "as"
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          "come"
        ],
        [
          "translation_word",
          [
            {
              "t": "bow_the_head",
              "w": "低头"
            }
          ],
          "down"
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          "looked"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "him"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "和"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ordinary",
              "w": "平常"
            }
          ],
          "usual"
        ],
        [
          "translation_word",
          [
            {
              "t": "same",
              "w": "一样"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "disdain_as_beneath_contempt",
              "w": "不屑一顾"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "obtain",
              "w": "得"
            },
            {
              "t": "exclamation",
              "w": "啦"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "really",
              "w": "真"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "fake",
              "w": "假"
            }
          ],
          "if"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "original",
              "w": "本来"
            }
          ],
          "thought"
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "have_expectations",
              "w": "期望"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "unlikely_to_go_so_far_as_to",
              "w": "不至于"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这种"
            }
          ],
          "this"
        ],
        [
          "translation_word",
          [
            {
              "t": "affair",
              "w": "事情"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "conscientious",
              "w": "认真"
            }
          ],
          "seriously"
        ],
        [
          "translation_word",
          [
            {
              "t": "particle_indicating_that_a_previously_asked_question_is_to_be_applied_to_the_preceding_word",
              "w": "呢"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "son",
              "w": "儿子"
            }
          ],
          "son"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "even_if",
              "w": "即使"
            }
          ],
          "even"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ability",
              "w": "才"
            }
          ],
          "only"
        ],
        [
          "translation_word",
          [
            {
              "t": "ten",
              "w": "十"
            }
          ],
          "ten"
        ],
        [
          "translation_word",
          [
            {
              "t": "classifier_for_years",
              "w": "岁"
            }
          ],
          "'re"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "about"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "is"
        ],
        [
          "translation_word",
          [
            {
              "t": "on_earth",
              "w": "世上"
            }
          ],
          "there"
        ],
        [
          "translation_word",
          [
            {
              "t": "most",
              "w": "最"
            }
          ],
          "most"
        ],
        [
          "translation_word",
          [
            {
              "t": "anti-science",
              "w": "反科学"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "affair",
              "w": "事情"
            }
          ],
          "thing"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "！"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "哈利 的 嘴边 掠过 一 丝 苦笑 。 爸爸 对 他 很 好 ， 可能 比 大部分 亲生 父亲 对 自己 的 孩子 还 好 。 哈利 被 送 去 最 好 的 小学 —— 失败 以后 ， 又 从 大把 缺 钱 花 的 大学生 中 雇人 做 他 的 私人 老师 。 哈利 可以 学习 任何 令 他 感 兴趣 的 课题 ， 可以 买 下 所 有 他 想 看 的 书 ， 可以 参加 任何 他 感 兴趣 的 数学 或者 科学 竞赛 。 只要 是 合理 的 要求 都 可以 满足 ， 只 除了 一样 ， 也许 ， 一丁点儿 的 尊重 。 堂堂 牛津大学 的 生化 教授 是 不 会 屈尊 听取 一个 小 男孩 的 意见 的 。 当然 了 ， 你 还 是 要 听 ， 而且 表现 出 感 兴趣 的 样子 ； 称职 的 家长 都 是 这样 的 ， 所以 ， 如果 你 自认为 是 个 称职 的 家长 ， 你 就 得 这么 做 。 但是 认真 考虑 一个 十 岁 的 小 男孩 的 意见 ？ 才怪 。 ",
      "english_source": "<p>\n Harry's mouth twisted bitterly. He was treated well, probably\nbetter than most genetic fathers treated their own children. Harry\nhad been sent to the best primary schools - and when that didn't\nwork out, he was provided with tutors from the endless pool of\nstarving students. Always Harry had been encouraged to study\nwhatever caught his attention, bought all the books that caught his\nfancy, sponsored in whatever maths or science competitions he\nentered. He was given anything reasonable that he wanted, except,\nmaybe, the slightest shred of respect. A Doctor teaching\nbiochemistry at Oxford could hardly be expected to listen to the\nadvice of a little boy. You would listen to Show Interest, of\ncourse; that's what a Good Parent would do, and so, if you\nconceived of yourself as a Good Parent, you would do it. But take a\nten-year-old\n <em>\n  seriously?\n </em>\n Hardly.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mouth",
              "w": "嘴"
            },
            {
              "t": "side",
              "w": "边"
            }
          ],
          "mouth"
        ],
        [
          "translation_word",
          [
            {
              "t": "flit_across",
              "w": "掠过"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "silk",
              "w": "丝"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "force_a_smile",
              "w": "苦笑"
            }
          ],
          "bitterly"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          "fathers"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          "better"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "might",
              "w": "可能"
            }
          ],
          "probably"
        ],
        [
          "translation_word",
          [
            {
              "t": "compared_to",
              "w": "比"
            }
          ],
          "than"
        ],
        [
          "translation_word",
          [
            {
              "t": "in_large_part",
              "w": "大部分"
            }
          ],
          "most"
        ],
        [
          "translation_word",
          [
            {
              "t": "one's_own",
              "w": "亲生"
            }
          ],
          "own"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "父亲"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "child",
              "w": "孩子"
            }
          ],
          "children"
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "to_cover",
              "w": "被"
            }
          ],
          "been"
        ],
        [
          "translation_word",
          [
            {
              "t": "deliver",
              "w": "送"
            }
          ],
          "sent"
        ],
        [
          "translation_word",
          [
            {
              "t": "go",
              "w": "去"
            }
          ],
          "to"
        ],
        [
          "translation_word",
          [
            {
              "t": "most",
              "w": "最"
            }
          ],
          "best"
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "elementary_school",
              "w": "小学"
            }
          ],
          "primary"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_defeated",
              "w": "失败"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "after",
              "w": "以后"
            }
          ],
          "when"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "又"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "from",
              "w": "从"
            }
          ],
          "from"
        ],
        [
          "translation_word",
          [
            {
              "t": "big",
              "w": "大"
            },
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "deficiency",
              "w": "缺"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "coin",
              "w": "钱"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "flower",
              "w": "花"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "university_student",
              "w": "大学生"
            }
          ],
          "students"
        ],
        [
          "translation_word",
          [
            {
              "t": "China",
              "w": "中"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "employ",
              "w": "雇"
            },
            {
              "t": "man",
              "w": "人"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "do",
              "w": "做"
            }
          ],
          "did"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "he"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "private",
              "w": "私人"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "teacher",
              "w": "老师"
            }
          ],
          "schools"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "learn",
              "w": "学习"
            }
          ],
          "study"
        ],
        [
          "translation_word",
          [
            {
              "t": "any",
              "w": "任何"
            }
          ],
          "whatever"
        ],
        [
          "translation_word",
          [
            {
              "t": "see_令狐[Ling2_hu2]",
              "w": "令"
            }
          ],
          "encouraged"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "feel",
              "w": "感"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "interest",
              "w": "兴趣"
            }
          ],
          "attention"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "task",
              "w": "课题"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "buy",
              "w": "买"
            }
          ],
          "bought"
        ],
        [
          "translation_word",
          [
            {
              "t": "down",
              "w": "下"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "actually",
              "w": "所"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "book",
              "w": "书"
            }
          ],
          "books"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "participate",
              "w": "参加"
            }
          ],
          "sponsored"
        ],
        [
          "translation_word",
          [
            {
              "t": "any",
              "w": "任何"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "feel",
              "w": "感"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "interest",
              "w": "兴趣"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mathematics",
              "w": "数学"
            }
          ],
          "maths"
        ],
        [
          "translation_word",
          [
            {
              "t": "or",
              "w": "或者"
            }
          ],
          "or"
        ],
        [
          "translation_word",
          [
            {
              "t": "science",
              "w": "科学"
            }
          ],
          "science"
        ],
        [
          "translation_word",
          [
            {
              "t": "race",
              "w": "竞赛"
            }
          ],
          "competitions"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "if_only",
              "w": "只要"
            }
          ],
          "anything"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "rational",
              "w": "合理"
            }
          ],
          "reasonable"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "request",
              "w": "要求"
            }
          ],
          "wanted"
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "都"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "satisfy",
              "w": "满足"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "besides",
              "w": "除了"
            }
          ],
          "except"
        ],
        [
          "translation_word",
          [
            {
              "t": "same",
              "w": "一样"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "perhaps",
              "w": "也许"
            }
          ],
          "maybe"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "a_tiny_bit",
              "w": "一丁点"
            },
            {
              "t": "child",
              "w": "儿"
            }
          ],
          "slightest"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "esteem",
              "w": "尊重"
            }
          ],
          "respect"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "grand",
              "w": "堂堂"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "University_of_Oxford",
              "w": "牛津大学"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "biochemistry",
              "w": "生化"
            }
          ],
          "biochemistry"
        ],
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            }
          ],
          "teaching"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "hardly"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          "expected"
        ],
        [
          "translation_word",
          [
            {
              "t": "condescend",
              "w": "屈尊"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hear",
              "w": "听取"
            }
          ],
          "listen"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "small",
              "w": "小"
            }
          ],
          "little"
        ],
        [
          "translation_word",
          [
            {
              "t": "boy",
              "w": "男孩"
            }
          ],
          "boy"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "idea",
              "w": "意见"
            }
          ],
          "advice"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "only_natural",
              "w": "当然"
            }
          ],
          "course"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "smile",
              "w": "听"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but_also",
              "w": "而且"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "show",
              "w": "表现"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "go_out",
              "w": "出"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "feel",
              "w": "感"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "interest",
              "w": "兴趣"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "appearance",
              "w": "样子"
            }
          ],
          "what"
        ],
        [
          "punctuation",
          "；"
        ],
        [
          "translation_word",
          [
            {
              "t": "well_qualified",
              "w": "称职"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "head_of_a_household",
              "w": "家长"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "都"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this_kind_of",
              "w": "这样"
            }
          ],
          "do"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "therefore",
              "w": "所以"
            }
          ],
          "so"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          "if"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "self",
              "w": "自"
            },
            {
              "t": "believe",
              "w": "认为"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "well_qualified",
              "w": "称职"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "head_of_a_household",
              "w": "家长"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "obtain",
              "w": "得"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "so_much",
              "w": "这么"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "do",
              "w": "做"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "但是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "conscientious",
              "w": "认真"
            }
          ],
          "seriously"
        ],
        [
          "translation_word",
          [
            {
              "t": "think_over",
              "w": "考虑"
            }
          ],
          "take"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ten",
              "w": "十"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "classifier_for_years",
              "w": "岁"
            }
          ],
          "ten-year-old"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "small",
              "w": "小"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "boy",
              "w": "男孩"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "idea",
              "w": "意见"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "translation_word",
          [
            {
              "t": "it'd_be_a_wonder_if...",
              "w": "才怪"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "有的 时候 哈利 很 想 对 爸爸 尖叫 。 ",
      "english_source": "<p>\n Sometimes Harry wanted to scream at his father.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "some",
              "w": "有的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "time",
              "w": "时候"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "wanted"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          "father"
        ],
        [
          "translation_word",
          [
            {
              "t": "screech",
              "w": "尖叫"
            }
          ],
          "scream"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 妈妈 ， ” 哈利 说 ， “ 如果 你 想 争 赢 爸爸 的 话 ， 可以 去 读 一下 费曼 物理学 讲义 第一 册 的 第二 章 。 ［ 1 ］ 里面 说 ， 有 很多 哲学家 曾经 认为 科学 要 这样 ， 要 那样 ， 可是 实际上 他们 都 错 了 ， 因为 科学 只 有 一 条 规则 ， 就 是 观测 的 结果 才 是 最终 的 仲裁者 —— 你 只 需要 观察 这个 世界 ， 把 看到 的 说 出来 就 行 了 。 嗯 …… 我 一时 想不起 是 在 哪里 看到 的 ， 不过 科学 的 理念 就 是 用 实验 而 不 是 用 争论 来 解决 问题 —— ” ",
      "english_source": "<p>\n \"Mum,\" Harry said. \"If you want to win this argument with Dad,\nlook in chapter two of the first book of the Feynman Lectures on\nPhysics. There's a quote there about how philosophers say a great\ndeal about what science absolutely requires, and it is all wrong,\nbecause the only rule in science is that the final arbiter is\nobservation - that you just have to look at the world and report\nwhat you see. Um... off the top of my head I can't think of where\nto find something about how it's an ideal of science to settle\nthings by experiment instead of arguments -\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "want"
        ],
        [
          "translation_word",
          [
            {
              "t": "strive_for",
              "w": "争"
            }
          ],
          "argument"
        ],
        [
          "translation_word",
          [
            {
              "t": "beat",
              "w": "赢"
            }
          ],
          "win"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "dialect",
              "w": "话"
            }
          ],
          "quote"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "go",
              "w": "去"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "comma",
              "w": "读"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "give_it_a_go",
              "w": "一下"
            }
          ],
          "look"
        ],
        [
          "translation_word",
          [
            {
              "t": "Feinman_or_Feynman",
              "w": "费曼"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "physics",
              "w": "物理学"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "teaching_materials",
              "w": "讲义"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "first",
              "w": "第一"
            }
          ],
          "first"
        ],
        [
          "translation_word",
          [
            {
              "t": "book",
              "w": "册"
            }
          ],
          "book"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "second",
              "w": "第二"
            }
          ],
          "two"
        ],
        [
          "translation_word",
          [
            {
              "t": "chapter",
              "w": "章"
            }
          ],
          "chapter"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "［"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "1"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "］"
        ],
        [
          "translation_word",
          [
            {
              "t": "inside",
              "w": "里面"
            }
          ],
          "there"
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "say"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            },
            {
              "t": "many",
              "w": "多"
            }
          ],
          "deal"
        ],
        [
          "translation_word",
          [
            {
              "t": "philosopher",
              "w": "哲学家"
            }
          ],
          "philosophers"
        ],
        [
          "translation_word",
          [
            {
              "t": "once",
              "w": "曾经"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "believe",
              "w": "认为"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "science",
              "w": "科学"
            }
          ],
          "science"
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this_kind_of",
              "w": "这样"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          "requires"
        ],
        [
          "translation_word",
          [
            {
              "t": "that_kind",
              "w": "那样"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          "it"
        ],
        [
          "translation_word",
          [
            {
              "t": "in_fact",
              "w": "实际上"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "都"
            }
          ],
          "all"
        ],
        [
          "translation_word",
          [
            {
              "t": "mistake",
              "w": "错"
            }
          ],
          "wrong"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "because",
              "w": "因为"
            }
          ],
          "because"
        ],
        [
          "translation_word",
          [
            {
              "t": "science",
              "w": "科学"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          "only"
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "strip",
              "w": "条"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "rule",
              "w": "规则"
            }
          ],
          "rule"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "is"
        ],
        [
          "translation_word",
          [
            {
              "t": "observe",
              "w": "观测"
            }
          ],
          "observation"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "bear_fruit",
              "w": "结果"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ability",
              "w": "才"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "final",
              "w": "最终"
            }
          ],
          "final"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "arbitration",
              "w": "仲裁"
            },
            {
              "t": "one_who__...",
              "w": "者"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          "just"
        ],
        [
          "translation_word",
          [
            {
              "t": "need",
              "w": "需要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "observe",
              "w": "观察"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "world",
              "w": "世界"
            }
          ],
          "world"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "看到"
            }
          ],
          "see"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come_out",
              "w": "出来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "row",
              "w": "行"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          "off"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "interjection_indicating_approval,_appreciation_or_agreement",
              "w": "嗯"
            }
          ],
          "think"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "……"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "my"
        ],
        [
          "translation_word",
          [
            {
              "t": "a_period_of_time",
              "w": "一时"
            }
          ],
          "ca"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "想不起"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "something"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "where?",
              "w": "哪里"
            }
          ],
          "where"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "看到"
            }
          ],
          "find"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "不过"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "science",
              "w": "科学"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "idea",
              "w": "理念"
            }
          ],
          "ideal"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "experiment",
              "w": "实验"
            }
          ],
          "experiment"
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "而"
            }
          ],
          "instead"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "argue",
              "w": "争论"
            }
          ],
          "arguments"
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "settle",
              "w": "解决"
            }
          ],
          "settle"
        ],
        [
          "translation_word",
          [
            {
              "t": "question",
              "w": "问题"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "他 的 妈妈 低头 看 着 他 ， 笑 了 。 “ 谢谢 你 ， 哈利 。 不过 —— ” 她 又 把头 抬 起来 ， 瞪 着 自己 的 丈夫 ， “ 我 并 不 想 争 赢 你 爸爸 。 我 只是 想 我 的 丈夫 能够 偶然 听 爱 他 的 妻子 一 句 话 ， 相信 她 一 次 —— ” ",
      "english_source": "<p>\n His mother looked down at him and smiled. \"Thank you, Harry. But\n-\" her head rose back up to stare at her husband. \"I don't want to\nwin an argument with your father. I want my husband to, to listen\nto his wife who loves him, and trust her just this once -\"\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "him"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          "mother"
        ],
        [
          "translation_word",
          [
            {
              "t": "bow_the_head",
              "w": "低头"
            }
          ],
          "down"
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          "looked"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "laugh",
              "w": "笑"
            }
          ],
          "smiled"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "thank",
              "w": "谢谢"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "不过"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "her"
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "又"
            }
          ],
          "back"
        ],
        [
          "translation_word",
          [
            {
              "t": "labor_contractor",
              "w": "把头"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lift",
              "w": "抬"
            }
          ],
          "head"
        ],
        [
          "translation_word",
          [
            {
              "t": "stand_up",
              "w": "起来"
            }
          ],
          "rose"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "open__wide",
              "w": "瞪"
            }
          ],
          "stare"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "husband",
              "w": "丈夫"
            }
          ],
          "husband"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "并"
            }
          ],
          "do"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "want"
        ],
        [
          "translation_word",
          [
            {
              "t": "strive_for",
              "w": "争"
            }
          ],
          "argument"
        ],
        [
          "translation_word",
          [
            {
              "t": "beat",
              "w": "赢"
            }
          ],
          "win"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "your"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          "father"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "my"
        ],
        [
          "translation_word",
          [
            {
              "t": "merely",
              "w": "只是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "husband",
              "w": "丈夫"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "be_capable_of",
              "w": "能够"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "incidentally",
              "w": "偶然"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "smile",
              "w": "听"
            }
          ],
          "listen"
        ],
        [
          "translation_word",
          [
            {
              "t": "love",
              "w": "爱"
            }
          ],
          "loves"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "wife_and_children",
              "w": "妻子"
            }
          ],
          "wife"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "sentence",
              "w": "句"
            }
          ],
          "just"
        ],
        [
          "translation_word",
          [
            {
              "t": "dialect",
              "w": "话"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_convinced",
              "w": "相信"
            }
          ],
          "trust"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "next_in_sequence",
              "w": "次"
            }
          ],
          "once"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "哈利 闭 了 闭 眼睛 。 不可救药 。 他 的 父母 都 是 不可救药 。 ",
      "english_source": "<p>\n Harry closed his eyes briefly.\n <em>\n  Hopeless.\n </em>\n Both of his\nparents were just hopeless.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "close",
              "w": "闭"
            }
          ],
          "closed"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "close",
              "w": "闭"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "eye",
              "w": "眼睛"
            }
          ],
          "eyes"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "incurable",
              "w": "不可救药"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "father_and_mother",
              "w": "父母"
            }
          ],
          "parents"
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "都"
            }
          ],
          "were"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "incurable",
              "w": "不可救药"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "现在 他 的 父母 又 进入 了 那种 争吵 模式 ， 妈妈 想 让 爸爸 觉得 愧疚 ， 爸爸 想 让 妈妈 感到 愚蠢 。 ",
      "english_source": "<p>\n Now his parents were getting into one of\n <em>\n  those\n </em>\n arguments again, one where his mother tried to make his father feel\nguilty, and his father tried to make his mother feel stupid.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "now",
              "w": "现在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "father_and_mother",
              "w": "父母"
            }
          ],
          "parents"
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "又"
            }
          ],
          "again"
        ],
        [
          "translation_word",
          [
            {
              "t": "enter",
              "w": "进入"
            }
          ],
          "into"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "that",
              "w": "那种"
            }
          ],
          "those"
        ],
        [
          "translation_word",
          [
            {
              "t": "quarrel",
              "w": "争吵"
            }
          ],
          "arguments"
        ],
        [
          "translation_word",
          [
            {
              "t": "mode",
              "w": "模式"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          "mother"
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "tried"
        ],
        [
          "translation_word",
          [
            {
              "t": "yield",
              "w": "让"
            }
          ],
          "make"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          "father"
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "觉得"
            }
          ],
          "feel"
        ],
        [
          "translation_word",
          [
            {
              "t": "feel_guilty",
              "w": "愧疚"
            }
          ],
          "guilty"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "yield",
              "w": "让"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "feel",
              "w": "感到"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "silly",
              "w": "愚蠢"
            }
          ],
          "stupid"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 我 回 房间 了 ， ” 哈利 宣布 说 ， 他 的 声音 有 点 发抖 ， “ 爸爸 ， 妈妈 ， 请 别 一直 吵 了 ， 反正 我们 很快 就 会 知道 答案 的 ， 对 不对 ？ ” ",
      "english_source": "<p>\n \"I'm going to go to my room,\" Harry announced. His voice\ntrembled a little. \"Please try not to fight too much about this,\nMum, Dad, we'll know soon enough how it comes out, right?\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "my"
        ],
        [
          "translation_word",
          [
            {
              "t": "circle",
              "w": "回"
            }
          ],
          "go"
        ],
        [
          "translation_word",
          [
            {
              "t": "room",
              "w": "房间"
            }
          ],
          "room"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "declare",
              "w": "宣布"
            }
          ],
          "announced"
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "voice",
              "w": "声音"
            }
          ],
          "voice"
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "point",
              "w": "点"
            }
          ],
          "little"
        ],
        [
          "translation_word",
          [
            {
              "t": "tremble",
              "w": "发抖"
            }
          ],
          "trembled"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "ask",
              "w": "请"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "don't!",
              "w": "别"
            }
          ],
          "not"
        ],
        [
          "translation_word",
          [
            {
              "t": "straight",
              "w": "一直"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "quarrel",
              "w": "吵"
            }
          ],
          "fight"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "anyway",
              "w": "反正"
            }
          ],
          "'m"
        ],
        [
          "translation_word",
          [
            {
              "t": "we",
              "w": "我们"
            }
          ],
          "we"
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            },
            {
              "t": "rapid",
              "w": "快"
            }
          ],
          "soon"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "know",
              "w": "知道"
            }
          ],
          "know"
        ],
        [
          "translation_word",
          [
            {
              "t": "answer",
              "w": "答案"
            }
          ],
          "'ll"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "incorrect",
              "w": "不对"
            }
          ],
          "right"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 没 问题 ， 哈利 ， ” 爸爸 说 ， 妈妈 亲 了 他 一下 ， 让 他 放心 。 但是 哈利 还 在 上楼 的 时候 ， 他们 就 又 争 起来 了 。 ",
      "english_source": "<p>\n \"Of course, Harry,\" said his father, and his mother gave him a\nreassuring kiss, and then they went on fighting while Harry climbed\nthe stairs to his bedroom.\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "没"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "question",
              "w": "问题"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          "his"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          "father"
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          "mother"
        ],
        [
          "translation_word",
          [
            {
              "t": "parent",
              "w": "亲"
            }
          ],
          "kiss"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "him"
        ],
        [
          "translation_word",
          [
            {
              "t": "give_it_a_go",
              "w": "一下"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "yield",
              "w": "让"
            }
          ],
          "gave"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "feel_relieved",
              "w": "放心"
            }
          ],
          "reassuring"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "但是"
            }
          ],
          "while"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "go_upstairs",
              "w": "上楼"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "time",
              "w": "时候"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "they"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "又"
            }
          ],
          "went"
        ],
        [
          "translation_word",
          [
            {
              "t": "strive_for",
              "w": "争"
            }
          ],
          "fighting"
        ],
        [
          "translation_word",
          [
            {
              "t": "stand_up",
              "w": "起来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "他 关上 身后 的 门 ， 开始 思考 。 ",
      "english_source": "<p>\n He shut the door behind him and tried to think.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "him"
        ],
        [
          "translation_word",
          [
            {
              "t": "close",
              "w": "关上"
            }
          ],
          "shut"
        ],
        [
          "translation_word",
          [
            {
              "t": "posthumous",
              "w": "身后"
            }
          ],
          "behind"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "gate",
              "w": "门"
            }
          ],
          "door"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "begin",
              "w": "开始"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "reflect_on",
              "w": "思考"
            }
          ],
          "think"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "奇怪 的 是 ， 他 本该 站 在 爸爸 一边 的 。 没 人 见 过 魔法 真实 存在 的 证据 ， 可是 按照 妈妈 的 说法 ， 有 一 整个 魔法 的 世界 存在 。 可是 这种 事情 这么 可能 保密 呢 ？ 用魔法 吗 ？ 这种 借口 也 太 可疑 了 。 ",
      "english_source": "<p>\n The funny thing was, he\n <em>\n  should\n </em>\n have agreed with Dad. No\none had ever seen any evidence of magic, and according to Mum,\nthere was a whole magical world out there. How could anyone keep\nsomething like that a secret? More magic? That seemed like a rather\nsuspicious sort of excuse.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "strange",
              "w": "奇怪"
            }
          ],
          "funny"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "was"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "he"
        ],
        [
          "translation_word",
          [
            {
              "t": "root",
              "w": "本"
            },
            {
              "t": "should",
              "w": "该"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "station",
              "w": "站"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          "thing"
        ],
        [
          "translation_word",
          [
            {
              "t": "one_side",
              "w": "一边"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "没"
            }
          ],
          "ever"
        ],
        [
          "translation_word",
          [
            {
              "t": "man",
              "w": "人"
            }
          ],
          "one"
        ],
        [
          "translation_word",
          [
            {
              "t": "see",
              "w": "见"
            }
          ],
          "seen"
        ],
        [
          "translation_word",
          [
            {
              "t": "PAST",
              "w": "过"
            }
          ],
          "had"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "translation_word",
          [
            {
              "t": "true",
              "w": "真实"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "exist",
              "w": "存在"
            }
          ],
          "there"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "evidence",
              "w": "证据"
            }
          ],
          "evidence"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "according_to",
              "w": "按照"
            }
          ],
          "according"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "expound_Buddhist_teachings",
              "w": "说法"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "whole",
              "w": "整个"
            }
          ],
          "whole"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "world",
              "w": "世界"
            }
          ],
          "world"
        ],
        [
          "translation_word",
          [
            {
              "t": "exist",
              "w": "存在"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这种"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "affair",
              "w": "事情"
            }
          ],
          "something"
        ],
        [
          "translation_word",
          [
            {
              "t": "so_much",
              "w": "这么"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "might",
              "w": "可能"
            }
          ],
          "could"
        ],
        [
          "translation_word",
          [
            {
              "t": "keep_sth_confidential",
              "w": "保密"
            }
          ],
          "secret"
        ],
        [
          "translation_word",
          [
            {
              "t": "particle_indicating_that_a_previously_asked_question_is_to_be_applied_to_the_preceding_word",
              "w": "呢"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            },
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "see_嗎啡|吗啡,_morphine",
              "w": "吗"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这种"
            }
          ],
          "sort"
        ],
        [
          "translation_word",
          [
            {
              "t": "use_as_an_excuse",
              "w": "借口"
            }
          ],
          "excuse"
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "highest",
              "w": "太"
            }
          ],
          "seemed"
        ],
        [
          "translation_word",
          [
            {
              "t": "suspicious",
              "w": "可疑"
            }
          ],
          "suspicious"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "情况 应该 很 明显 ， 妈妈 要 不 是 在 开玩笑 ， 要 不 就 在 撒谎 ， 或者 就 是 疯了 ， 按 糟糕 的 程度 升序 排列 。 如果 那 封 信 是 妈妈 自己 寄 的 ， 就 可以 解释 为什么 这 封 没 贴 邮票 的 信 会 出现 在 他们 的 信箱 里 。 一点点 的 精神 失常 可 比 宇宙 真的 那样 运行 可能性 大多 了 。 ",
      "english_source": "<p>\n It should have been a clean case for Mum joking, lying or being\ninsane, in ascending order of awfulness. If Mum had sent the letter\nherself, that would explain how it arrived at the letterbox without\na stamp. A little insanity was far, far less improbable than the\nuniverse really working like that.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "circumstances",
              "w": "情况"
            }
          ],
          "case"
        ],
        [
          "translation_word",
          [
            {
              "t": "ought_to",
              "w": "应该"
            }
          ],
          "should"
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "clear",
              "w": "明显"
            }
          ],
          "been"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          "in"
        ],
        [
          "translation_word",
          [
            {
              "t": "play_a_joke",
              "w": "开玩笑"
            }
          ],
          "joking"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "tell_lies",
              "w": "撒谎"
            }
          ],
          "lying"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "or",
              "w": "或者"
            }
          ],
          "or"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "insane",
              "w": "疯"
            },
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "press",
              "w": "按"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "too_bad",
              "w": "糟糕"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "degree",
              "w": "程度"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ascending_order",
              "w": "升序"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "arrange_in_order",
              "w": "排列"
            }
          ],
          "order"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          "had"
        ],
        [
          "translation_word",
          [
            {
              "t": "that",
              "w": "那"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "grant",
              "w": "封"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          "herself"
        ],
        [
          "translation_word",
          [
            {
              "t": "send",
              "w": "寄"
            }
          ],
          "sent"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "explanation",
              "w": "解释"
            }
          ],
          "explain"
        ],
        [
          "translation_word",
          [
            {
              "t": "why?",
              "w": "为什么"
            }
          ],
          "how"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "grant",
              "w": "封"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "没"
            }
          ],
          "without"
        ],
        [
          "translation_word",
          [
            {
              "t": "stick",
              "w": "贴"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stamp",
              "w": "邮票"
            }
          ],
          "stamp"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          "would"
        ],
        [
          "translation_word",
          [
            {
              "t": "appear",
              "w": "出现"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          "at"
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mailbox",
              "w": "信箱"
            }
          ],
          "letterbox"
        ],
        [
          "translation_word",
          [
            {
              "t": "lining",
              "w": "里"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "a_little_bit",
              "w": "一点点"
            }
          ],
          "little"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "spirit",
              "w": "精神"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not_normal",
              "w": "失常"
            }
          ],
          "insanity"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "compared_to",
              "w": "比"
            }
          ],
          "than"
        ],
        [
          "translation_word",
          [
            {
              "t": "universe",
              "w": "宇宙"
            }
          ],
          "universe"
        ],
        [
          "translation_word",
          [
            {
              "t": "really",
              "w": "真"
            },
            {
              "t": "of",
              "w": "的"
            }
          ],
          "really"
        ],
        [
          "translation_word",
          [
            {
              "t": "that_kind",
              "w": "那样"
            }
          ],
          "less"
        ],
        [
          "translation_word",
          [
            {
              "t": "move_along_one's_course",
              "w": "运行"
            }
          ],
          "working"
        ],
        [
          "translation_word",
          [
            {
              "t": "possibility",
              "w": "可能性"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "for_the_most_part",
              "w": "大多"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "问题 是 ， 哈利 心中 的 某 一 部分 完全 确信 魔法 的 真实 存在 。 自从 他 看见 这 封 号称 来自 霍 格沃茨 魔法 与 巫师 学校 的 信 ， 他 就 确信 了 整件 事 。 ",
      "english_source": "<p>\n Except that some part of Harry was utterly convinced that magic\nwas real, and had been since the instant he saw the putative letter\nfrom the Hogwarts School of Witchcraft and Wizardry.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "question",
              "w": "问题"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "was"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "central_point",
              "w": "心中"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "some",
              "w": "某"
            }
          ],
          "some"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "part",
              "w": "部分"
            }
          ],
          "part"
        ],
        [
          "translation_word",
          [
            {
              "t": "complete",
              "w": "完全"
            }
          ],
          "utterly"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_convinced",
              "w": "确信"
            }
          ],
          "convinced"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "true",
              "w": "真实"
            }
          ],
          "real"
        ],
        [
          "translation_word",
          [
            {
              "t": "exist",
              "w": "存在"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "since",
              "w": "自从"
            }
          ],
          "since"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "he"
        ],
        [
          "translation_word",
          [
            {
              "t": "see",
              "w": "看见"
            }
          ],
          "saw"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "grant",
              "w": "封"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_known_as",
              "w": "号称"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come_from",
              "w": "来自"
            }
          ],
          "from"
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "与"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "wizard",
              "w": "巫师"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "school",
              "w": "学校"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "be_convinced",
              "w": "确信"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "exactly",
              "w": "整"
            },
            {
              "t": "item",
              "w": "件"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "matter",
              "w": "事"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "哈利 揉 了 揉 前额 ， 做 了 个 鬼脸 。 不要 相信 你 自己 的 所有 想法 ， 他 看 过 的 一 本 书 里 这么 说 。 ",
      "english_source": "<p>\n Harry rubbed his forehead, grimacing.\n <em>\n  Don't believe\neverything you think,\n </em>\n one of his books had said.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "knead",
              "w": "揉"
            }
          ],
          "rubbed"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "knead",
              "w": "揉"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "forehead",
              "w": "前额"
            }
          ],
          "forehead"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "do",
              "w": "做"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "wry_face",
              "w": "鬼脸"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "don't!",
              "w": "不要"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_convinced",
              "w": "相信"
            }
          ],
          "believe"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "所有"
            }
          ],
          "everything"
        ],
        [
          "translation_word",
          [
            {
              "t": "way_of_thinking",
              "w": "想法"
            }
          ],
          "think"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "PAST",
              "w": "过"
            }
          ],
          "had"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "one"
        ],
        [
          "translation_word",
          [
            {
              "t": "root",
              "w": "本"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "book",
              "w": "书"
            }
          ],
          "books"
        ],
        [
          "translation_word",
          [
            {
              "t": "lining",
              "w": "里"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "so_much",
              "w": "这么"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "可是 这种 奇怪 的 确定 不疑 …… 哈利 发现 自己 真的 认为 会 有 一个 霍 格沃茨 的 教授 来 会 到 家里 ， 挥挥 魔杖 ， 然后 魔法 就 出现 了 。 这个 奇怪 的 想法 完全 不 考虑 被 证 伪 的 可能 － 比如 ， 它 一点 也 不 想 找 借口 说 ， 说不定 教授会 因为 什么 原因 来 不 了 ， 或者 说不定 来 的 教授 可能 只 会 弄弯 勺子 。 ",
      "english_source": "<p>\n But this bizarre certainty... Harry was finding himself just\n <em>\n  expecting\n </em>\n that, yes, a Hogwarts professor would show up\nand wave a wand and magic would come out. The strange certainty was\nmaking no effort to guard itself against falsification - wasn't\nmaking excuses in advance for why there wouldn't be a professor, or\nthe professor would only be able to bend spoons.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这种"
            }
          ],
          "this"
        ],
        [
          "translation_word",
          [
            {
              "t": "strange",
              "w": "奇怪"
            }
          ],
          "bizarre"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "definite",
              "w": "确定"
            }
          ],
          "certainty"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            },
            {
              "t": "doubt",
              "w": "疑"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "……"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "find",
              "w": "发现"
            }
          ],
          "finding"
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          "himself"
        ],
        [
          "translation_word",
          [
            {
              "t": "really",
              "w": "真"
            },
            {
              "t": "of",
              "w": "的"
            }
          ],
          "yes"
        ],
        [
          "translation_word",
          [
            {
              "t": "believe",
              "w": "认为"
            }
          ],
          "that"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          "would"
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            }
          ],
          "professor"
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "到"
            }
          ],
          "up"
        ],
        [
          "translation_word",
          [
            {
              "t": "home",
              "w": "家里"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "wave",
              "w": "挥"
            },
            {
              "t": "wave",
              "w": "挥"
            }
          ],
          "wave"
        ],
        [
          "translation_word",
          [
            {
              "t": "magic_wand",
              "w": "魔杖"
            }
          ],
          "wand"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "after",
              "w": "然后"
            }
          ],
          "and"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "appear",
              "w": "出现"
            }
          ],
          "show"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "strange",
              "w": "奇怪"
            }
          ],
          "strange"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "way_of_thinking",
              "w": "想法"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "complete",
              "w": "完全"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "no"
        ],
        [
          "translation_word",
          [
            {
              "t": "think_over",
              "w": "考虑"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "to_cover",
              "w": "被"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "admonish",
              "w": "证"
            }
          ],
          "against"
        ],
        [
          "translation_word",
          [
            {
              "t": "false",
              "w": "伪"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "might",
              "w": "可能"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "－"
        ],
        [
          "translation_word",
          [
            {
              "t": "for_example",
              "w": "比如"
            }
          ],
          "effort"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "it",
              "w": "它"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "a_bit",
              "w": "一点"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "try_to_find",
              "w": "找"
            }
          ],
          "come"
        ],
        [
          "translation_word",
          [
            {
              "t": "use_as_an_excuse",
              "w": "借口"
            }
          ],
          "excuses"
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "can't_say_for_sure",
              "w": "说不定"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            },
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "because",
              "w": "因为"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "what?",
              "w": "什么"
            }
          ],
          "why"
        ],
        [
          "translation_word",
          [
            {
              "t": "cause",
              "w": "原因"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "or",
              "w": "或者"
            }
          ],
          "or"
        ],
        [
          "translation_word",
          [
            {
              "t": "can't_say_for_sure",
              "w": "说不定"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "professor",
              "w": "教授"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "might",
              "w": "可能"
            }
          ],
          "able"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          "only"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lane",
              "w": "弄"
            },
            {
              "t": "bend",
              "w": "弯"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "scoop",
              "w": "勺子"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "你 是 从 哪里 来 的 呢 ， 奇怪 的 预感 ？ 哈利 问 他 的 大脑 。 我 为什么 相信 我 所 相信 的 ？ ",
      "english_source": "<p>\n <em>\n  Where do you come from, strange little prediction?\n </em>\n Harry directed the thought at his brain.\n <em>\n  Why do I believe what\nI believe?\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "from",
              "w": "从"
            }
          ],
          "from"
        ],
        [
          "translation_word",
          [
            {
              "t": "where?",
              "w": "哪里"
            }
          ],
          "?"
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          "come"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "particle_indicating_that_a_previously_asked_question_is_to_be_applied_to_the_preceding_word",
              "w": "呢"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "strange",
              "w": "奇怪"
            }
          ],
          "strange"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "have_a_premonition",
              "w": "预感"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ask",
              "w": "问"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "brain",
              "w": "大脑"
            }
          ],
          "brain"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "why?",
              "w": "为什么"
            }
          ],
          "what"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_convinced",
              "w": "相信"
            }
          ],
          "believe"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "actually",
              "w": "所"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "be_convinced",
              "w": "相信"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "？"
        ]
      ]
    },
    {
      "chinese_source": "在 一般 情况 下 哈利 都 很 擅长 回答 这个 问题 ， 可是 这 一 次 ， 他 完全 搞 不 懂 自己 的 脑子 在 想 什么 。 ",
      "english_source": "<p>\n Usually Harry was pretty good at answering that question, but in\nthis particular case, he had no\n <em>\n  clue\n </em>\n what his brain was\nthinking.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          "at"
        ],
        [
          "translation_word",
          [
            {
              "t": "same",
              "w": "一般"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "circumstances",
              "w": "情况"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "down",
              "w": "下"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "都"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          "pretty"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_good_at",
              "w": "擅长"
            }
          ],
          "good"
        ],
        [
          "translation_word",
          [
            {
              "t": "reply",
              "w": "回答"
            }
          ],
          "answering"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这个"
            }
          ],
          "this"
        ],
        [
          "translation_word",
          [
            {
              "t": "question",
              "w": "问题"
            }
          ],
          "question"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          "but"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "next_in_sequence",
              "w": "次"
            }
          ],
          "case"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "he"
        ],
        [
          "translation_word",
          [
            {
              "t": "complete",
              "w": "完全"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "do",
              "w": "搞"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "no"
        ],
        [
          "translation_word",
          [
            {
              "t": "understand",
              "w": "懂"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "brains",
              "w": "脑子"
            }
          ],
          "brain"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "thinking"
        ],
        [
          "translation_word",
          [
            {
              "t": "what?",
              "w": "什么"
            }
          ],
          "what"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "他 在 心里 耸 了 耸 肩膀 。 一 扇 门 上 如果 是 一 块 金属板 ， 就 是 用 来 推 的 ， 如果 是 门把 的 话 ， 就 是 用 来 拉 的 。 对于 一个 可以 验证 的 猜想 ， 你 能 做 的 事情 就 是 验证 一下 。 ",
      "english_source": "<p>\n Harry mentally shrugged. A flat metal plate on a door affords\npushing, and a handle on a door affords pulling, and the thing to\ndo with a testable hypothesis is to go and test it.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "chest",
              "w": "心里"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "excite",
              "w": "耸"
            }
          ],
          "shrugged"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "excite",
              "w": "耸"
            }
          ],
          "plate"
        ],
        [
          "translation_word",
          [
            {
              "t": "shoulder",
              "w": "肩膀"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "fan",
              "w": "扇"
            }
          ],
          "door"
        ],
        [
          "translation_word",
          [
            {
              "t": "gate",
              "w": "门"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "above",
              "w": "上"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "is"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lump",
              "w": "块"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "metal_plate",
              "w": "金属板"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "push",
              "w": "推"
            }
          ],
          "pushing"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "gate",
              "w": "门"
            },
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "dialect",
              "w": "话"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "pull",
              "w": "拉"
            }
          ],
          "pulling"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "regarding",
              "w": "对于"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可以"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "inspect_and_verify",
              "w": "验证"
            }
          ],
          "test"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "guess",
              "w": "猜想"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "go"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "能"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "do",
              "w": "做"
            }
          ],
          "do"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "affair",
              "w": "事情"
            }
          ],
          "thing"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "inspect_and_verify",
              "w": "验证"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "give_it_a_go",
              "w": "一下"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "他 从 桌上 拿 起 一 张 打 了 格子 的 纸 ， 开始 写信 。 ",
      "english_source": "<p>\n He took a piece of lined paper from his desk, and started\nwriting.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "from",
              "w": "从"
            }
          ],
          "from"
        ],
        [
          "translation_word",
          [
            {
              "t": "table",
              "w": "桌"
            },
            {
              "t": "above",
              "w": "上"
            }
          ],
          "desk"
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "拿"
            }
          ],
          "took"
        ],
        [
          "translation_word",
          [
            {
              "t": "rise",
              "w": "起"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "piece"
        ],
        [
          "translation_word",
          [
            {
              "t": "open_up",
              "w": "张"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "dozen",
              "w": "打"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lattice",
              "w": "格子"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "paper",
              "w": "纸"
            }
          ],
          "paper"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "begin",
              "w": "开始"
            }
          ],
          "started"
        ],
        [
          "translation_word",
          [
            {
              "t": "write_a_letter",
              "w": "写信"
            }
          ],
          "writing"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "亲爱 的 副 校长 ",
      "english_source": "<p>\n <em>\n  Dear Deputy Headmistress\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "dear",
              "w": "亲爱"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "secondary",
              "w": "副"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "president",
              "w": "校长"
            }
          ],
          ""
        ]
      ]
    },
    {
      "chinese_source": "哈利 停 下来 ， 考虑 了 一会儿 ； 然后 重新 换 了 一 张 新 纸 ， 把 自动 铅笔 的 铅芯 再 按 出来 一 毫米 。 他 决定 写 得 工整 一些 。 ",
      "english_source": "<p>\n Harry paused, reflecting; then discarded the paper for another,\ntapping another millimetre of graphite from his mechanical pencil.\nThis called for careful calligraphy.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stop",
              "w": "停"
            }
          ],
          "paused"
        ],
        [
          "translation_word",
          [
            {
              "t": "come_down",
              "w": "下来"
            }
          ],
          "reflecting"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "think_over",
              "w": "考虑"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "a_moment",
              "w": "一会儿"
            }
          ],
          "then"
        ],
        [
          "punctuation",
          "；"
        ],
        [
          "translation_word",
          [
            {
              "t": "after",
              "w": "然后"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "重新"
            }
          ],
          "another"
        ],
        [
          "translation_word",
          [
            {
              "t": "exchange",
              "w": "换"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "open_up",
              "w": "张"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "abbr._for_Xinjiang_新疆[Xin1_jiang1]_or_Singapore_新加坡[Xin1_jia1_po1]",
              "w": "新"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "paper",
              "w": "纸"
            }
          ],
          "paper"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "automatic",
              "w": "自动"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "pencil",
              "w": "铅笔"
            }
          ],
          "pencil"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lead",
              "w": "铅"
            },
            {
              "t": "lamp_pith",
              "w": "芯"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "再"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "press",
              "w": "按"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come_out",
              "w": "出来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "millimeter",
              "w": "毫米"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "decide",
              "w": "决定"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "write",
              "w": "写"
            }
          ],
          "calligraphy"
        ],
        [
          "translation_word",
          [
            {
              "t": "obtain",
              "w": "得"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "fine_work",
              "w": "工整"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "some",
              "w": "一些"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "亲爱 的 米勒娃·麦格 副 校长 , ",
      "english_source": "<p>\n <em>\n  Dear Deputy Headmistress Minerva McGonagall,\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "dear",
              "w": "亲爱"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Minerva_McGonagall",
              "w": "米勒娃·麦格"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "secondary",
              "w": "副"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "president",
              "w": "校长"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": ","
            }
          ],
          ""
        ]
      ]
    },
    {
      "chinese_source": "或 相关 人士 ： ",
      "english_source": "<p>\n <em>\n  Or Whomsoever It May Concern:\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "maybe",
              "w": "或"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "related",
              "w": "相关"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "person",
              "w": "人士"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "："
        ]
      ]
    },
    {
      "chinese_source": "我 最近 收到 您 寄 来 的 霍 格沃茨 的 录取 信 ， 收信人 是 H·波特 先生 。 可能 您 不 清楚 ， 我 的 亲生父母 ， 詹姆·波特 和 莉莉·波特 （ 婚前 是 莉莉·伊万 斯 ） 已经 过 世 。 我 被 莉莉 的 姐姐 佩妮·伊万 斯－维瑞斯 和 她 的 丈夫 ， 迈克·维瑞斯－伊万 斯 收养 了 。 ",
      "english_source": "<p>\n <em>\n  I recently received your letter of acceptance to Hogwarts,\naddressed to Mr. H. Potter. You may not be aware that my genetic\nparents, James Potter and Lily Potter (formerly Lily Evans) are\ndead. I was adopted by Lily's sister, Petunia Evans-Verres, and her\nhusband, Michael Verres-Evans.\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "recent",
              "w": "最近"
            }
          ],
          "recently"
        ],
        [
          "translation_word",
          [
            {
              "t": "receive",
              "w": "收到"
            }
          ],
          "received"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "您"
            }
          ],
          "your"
        ],
        [
          "translation_word",
          [
            {
              "t": "send",
              "w": "寄"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "accept_an_applicant__who_passes_an_entrance_exam",
              "w": "录取"
            }
          ],
          "acceptance"
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          "letter"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "收信人"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "H._Potter",
              "w": "H·波特"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Mister",
              "w": "先生"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "might",
              "w": "可能"
            }
          ],
          "may"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "您"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "not"
        ],
        [
          "translation_word",
          [
            {
              "t": "clear",
              "w": "清楚"
            }
          ],
          "aware"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "my"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "parent",
              "w": "亲"
            },
            {
              "t": "biological_parents",
              "w": "生父母"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "James_Potter",
              "w": "詹姆·波特"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "和"
            }
          ],
          "and"
        ],
        [
          "translation_word",
          [
            {
              "t": "Lily_Potter",
              "w": "莉莉·波特"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "（"
        ],
        [
          "translation_word",
          [
            {
              "t": "premarital",
              "w": "婚前"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Lily_Evans",
              "w": "莉莉·伊万"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "S",
              "w": "斯"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "）"
        ],
        [
          "translation_word",
          [
            {
              "t": "already",
              "w": "已经"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "PAST",
              "w": "过"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "life",
              "w": "世"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "to_cover",
              "w": "被"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "LI",
              "w": "莉"
            },
            {
              "t": "LI",
              "w": "莉"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "older_sister",
              "w": "姐姐"
            }
          ],
          "sister"
        ],
        [
          "translation_word",
          [
            {
              "t": "Penny-Evans",
              "w": "佩妮·伊万"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "斯－维瑞斯"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "和"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "her"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "husband",
              "w": "丈夫"
            }
          ],
          "husband"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "NAME?",
              "w": "迈克·维瑞斯－伊万"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "S",
              "w": "斯"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "take_in_and_care_for",
              "w": "收养"
            }
          ],
          "adopted"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "我 对 去 霍 格沃茨 上学 非常 有 兴趣 ， 前提 是 这个 地方 真 的 存在 。 我 的 妈妈 佩妮 说 她 见 过 魔法 ， 可是 她 自己 不 会用 。 我 的 爸爸 非常 怀疑 。 我 自己 不 确定 。 并且 我 不 知道 到 哪里 去 购买 您 的 录取 信上 列 出 的 书 和 用品 。 ",
      "english_source": "<p>\n <em>\n  I am extremely interested in attending Hogwarts, conditional\non such a place actually existing. Only my mother Petunia says she\nknows about magic, and she can't use it herself. My father is\nhighly sceptical. I myself am uncertain. I also don't know where to\nobtain any of the books or equipment listed in your acceptance\nletter.\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "am"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "go",
              "w": "去"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "go_to_school",
              "w": "上学"
            }
          ],
          "attending"
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "非常"
            }
          ],
          "extremely"
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "interest",
              "w": "兴趣"
            }
          ],
          "interested"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "premise",
              "w": "前提"
            }
          ],
          "conditional"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这个"
            }
          ],
          "such"
        ],
        [
          "translation_word",
          [
            {
              "t": "region",
              "w": "地方"
            }
          ],
          "place"
        ],
        [
          "translation_word",
          [
            {
              "t": "really",
              "w": "真"
            }
          ],
          "actually"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "exist",
              "w": "存在"
            }
          ],
          "existing"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "my"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          "mother"
        ],
        [
          "translation_word",
          [
            {
              "t": "Petunia",
              "w": "佩妮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "says"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "she"
        ],
        [
          "translation_word",
          [
            {
              "t": "see",
              "w": "见"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "PAST",
              "w": "过"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          "it"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          "herself"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            },
            {
              "t": "use",
              "w": "用"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          "father"
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "非常"
            }
          ],
          "highly"
        ],
        [
          "translation_word",
          [
            {
              "t": "doubt",
              "w": "怀疑"
            }
          ],
          "sceptical"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          "myself"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "definite",
              "w": "确定"
            }
          ],
          "uncertain"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "并且"
            }
          ],
          "also"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "know",
              "w": "知道"
            }
          ],
          "know"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "到"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "where?",
              "w": "哪里"
            }
          ],
          "where"
        ],
        [
          "translation_word",
          [
            {
              "t": "go",
              "w": "去"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "purchase",
              "w": "购买"
            }
          ],
          "obtain"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "您"
            }
          ],
          "your"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "accept_an_applicant__who_passes_an_entrance_exam",
              "w": "录取"
            }
          ],
          "acceptance"
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            },
            {
              "t": "above",
              "w": "上"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "arrange",
              "w": "列"
            }
          ],
          "listed"
        ],
        [
          "translation_word",
          [
            {
              "t": "go_out",
              "w": "出"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "book",
              "w": "书"
            }
          ],
          "books"
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "和"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "articles_for_use",
              "w": "用品"
            }
          ],
          "equipment"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "妈妈 提到 您 派 了 一 位 霍 格沃茨 的 代表 去 莉莉·波特 （ 那时 是 莉莉·伊万 斯 ） 家 ， 向 她 的 家人 证明了 魔法 确实 存在 ， 并且 ， 我 猜想 ， 您 帮 她 买 到 了 学校 用品 。 如果 您 能 为 我 的 家庭 做 同样 的 事 的 话 ， 我们 会 非常 感激 。 ",
      "english_source": "<p>\n <em>\n  Mother mentioned that you sent a Hogwarts representative to\nLily Potter (then Lily Evans) in order to demonstrate to her family\nthat magic was real, and, I presume, help Lily obtain her school\nmaterials. If you could do this for my own family it would be\nextremely helpful.\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mention",
              "w": "提到"
            }
          ],
          "mentioned"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "您"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "clique",
              "w": "派"
            }
          ],
          "sent"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "position",
              "w": "位"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "representative",
              "w": "代表"
            }
          ],
          "representative"
        ],
        [
          "translation_word",
          [
            {
              "t": "go",
              "w": "去"
            }
          ],
          "to"
        ],
        [
          "translation_word",
          [
            {
              "t": "Lily_Potter",
              "w": "莉莉·波特"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "（"
        ],
        [
          "translation_word",
          [
            {
              "t": "then",
              "w": "那时"
            }
          ],
          "then"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Lily_Evans",
              "w": "莉莉·伊万"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "S",
              "w": "斯"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "）"
        ],
        [
          "translation_word",
          [
            {
              "t": "home_;_family",
              "w": "家"
            }
          ],
          "family"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "towards",
              "w": "向"
            }
          ],
          "demonstrate"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "her"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "household",
              "w": "家人"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "admonish",
              "w": "证"
            },
            {
              "t": "understand_clearly",
              "w": "明了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "translation_word",
          [
            {
              "t": "indeed",
              "w": "确实"
            }
          ],
          "real"
        ],
        [
          "translation_word",
          [
            {
              "t": "exist",
              "w": "存在"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "并且"
            }
          ],
          "and"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "guess",
              "w": "猜想"
            }
          ],
          "presume"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "您"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "help",
              "w": "帮"
            }
          ],
          "help"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "buy",
              "w": "买"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "到"
            }
          ],
          "obtain"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "school",
              "w": "学校"
            }
          ],
          "school"
        ],
        [
          "translation_word",
          [
            {
              "t": "articles_for_use",
              "w": "用品"
            }
          ],
          "materials"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "您"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "能"
            }
          ],
          "could"
        ],
        [
          "translation_word",
          [
            {
              "t": "as",
              "w": "为"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "my"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "family",
              "w": "家庭"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "do",
              "w": "做"
            }
          ],
          "do"
        ],
        [
          "translation_word",
          [
            {
              "t": "same",
              "w": "同样"
            }
          ],
          "it"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "matter",
              "w": "事"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "dialect",
              "w": "话"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "we",
              "w": "我们"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          "would"
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "非常"
            }
          ],
          "extremely"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_grateful",
              "w": "感激"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "真诚 的 ， ",
      "english_source": "<p>\n <em>\n  Sincerely,\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "true",
              "w": "真诚"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ]
      ]
    },
    {
      "chinese_source": "哈利 · 詹姆·波特 － 伊万斯－维瑞斯 ",
      "english_source": "<p>\n <em>\n  Harry James Potter-Evans-Verres.\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "·",
              "w": "·"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "James_Potter",
              "w": "詹姆·波特"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "－"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "伊万斯－维瑞斯"
            }
          ],
          ""
        ]
      ]
    },
    {
      "chinese_source": "哈利 写 上 他们 目前 的 地址 ， 把 信 折 好 放 进 信封 ， 在 收件人 的 部分 写 上 霍 格沃茨 。 他 考虑 了 一下 ， 又 拿 来 一 根 蜡烛 ， 在 信封 的 封口 处 滴 了 一 滴 蜡油 ， 在 上面 用 铅笔刀 尖刻 下 了 他 的 名字 的 缩写 H.J. P.E. V. 反正 都 是 发疯 ， 他 决定 要 疯 出 自己 的 风格 。 ",
      "english_source": "<p>\n Harry added their current address, then folded up the letter and\nput it in an envelope, which he addressed to Hogwarts. Further\nconsideration led him to obtain a candle and drip wax onto the flap\nof the envelope, into which, using a penknife's tip, he impressed\nthe initials H.J.P.E.V. If he was going to descend into this\nmadness, he was going to do it with style.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "write",
              "w": "写"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "above",
              "w": "上"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "their"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_the_present_time",
              "w": "目前"
            }
          ],
          "current"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "address",
              "w": "地址"
            }
          ],
          "address"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "break",
              "w": "折"
            }
          ],
          "folded"
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "put",
              "w": "放"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "go_forward",
              "w": "进"
            }
          ],
          "up"
        ],
        [
          "translation_word",
          [
            {
              "t": "envelope",
              "w": "信封"
            }
          ],
          "envelope"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          "in"
        ],
        [
          "translation_word",
          [
            {
              "t": "recipient",
              "w": "收件人"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "part",
              "w": "部分"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "write",
              "w": "写"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "above",
              "w": "上"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "him"
        ],
        [
          "translation_word",
          [
            {
              "t": "think_over",
              "w": "考虑"
            }
          ],
          "consideration"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "give_it_a_go",
              "w": "一下"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "again",
              "w": "又"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "拿"
            }
          ],
          "obtain"
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "root",
              "w": "根"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "candle",
              "w": "蜡烛"
            }
          ],
          "candle"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "envelope",
              "w": "信封"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "close_up",
              "w": "封口"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "reside",
              "w": "处"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "a_drop",
              "w": "滴"
            }
          ],
          "drip"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "a_drop",
              "w": "滴"
            }
          ],
          "onto"
        ],
        [
          "translation_word",
          [
            {
              "t": "candle",
              "w": "蜡"
            },
            {
              "t": "oil",
              "w": "油"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "on_top_of",
              "w": "上面"
            }
          ],
          "impressed"
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            }
          ],
          "using"
        ],
        [
          "translation_word",
          [
            {
              "t": "pencil_sharpener",
              "w": "铅笔刀"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "caustic",
              "w": "尖刻"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "down",
              "w": "下"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "he"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "name",
              "w": "名字"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "abbreviation",
              "w": "缩写"
            }
          ],
          "initials"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "H.J."
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "P.E."
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "V."
            }
          ],
          "."
        ],
        [
          "translation_word",
          [
            {
              "t": "anyway",
              "w": "反正"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "都"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "go_mad",
              "w": "发疯"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "decide",
              "w": "决定"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          "going"
        ],
        [
          "translation_word",
          [
            {
              "t": "insane",
              "w": "疯"
            }
          ],
          "madness"
        ],
        [
          "translation_word",
          [
            {
              "t": "go_out",
              "w": "出"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "style",
              "w": "风格"
            }
          ],
          "style"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "然后 他 打 开门 ， 回到 了 楼下 。 爸爸 坐 在 客厅 读 一 本 高深 的 数学 书 ， 想 要 表现 他 是 多么 聪明 ； 妈妈 在 厨房 准备 爸爸 最爱 吃 的 晚饭 ， 想 要 证明 她 是 多么 爱 他 。 看 起来 他们 已经 互相 不说话 了 。 吵架 很 可怕 ， 可是 不 吵架 似乎 还 要 糟 得 多 。 ",
      "english_source": "<p>\n Then he opened his door and went back downstairs. His father was\nsitting in the living-room and reading a book of higher maths to\nshow how smart he was; and his mother was in the kitchen preparing\none of his father's favourite meals to show how loving she was. It\ndidn't look like they were talking to one another at all. As scary\nas arguments could be,\n <em>\n  not arguing\n </em>\n was somehow much\nworse.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "after",
              "w": "然后"
            }
          ],
          "and"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "he"
        ],
        [
          "translation_word",
          [
            {
              "t": "dozen",
              "w": "打"
            }
          ],
          "went"
        ],
        [
          "translation_word",
          [
            {
              "t": "open_a_door",
              "w": "开门"
            }
          ],
          "door"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "return_to",
              "w": "回到"
            }
          ],
          "back"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "downstairs",
              "w": "楼下"
            }
          ],
          "downstairs"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          "father"
        ],
        [
          "translation_word",
          [
            {
              "t": "sit",
              "w": "坐"
            }
          ],
          "sitting"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          "in"
        ],
        [
          "translation_word",
          [
            {
              "t": "living_room",
              "w": "客厅"
            }
          ],
          "living-room"
        ],
        [
          "translation_word",
          [
            {
              "t": "comma",
              "w": "读"
            }
          ],
          "reading"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "root",
              "w": "本"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "profound",
              "w": "高深"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mathematics",
              "w": "数学"
            }
          ],
          "maths"
        ],
        [
          "translation_word",
          [
            {
              "t": "book",
              "w": "书"
            }
          ],
          "book"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "to"
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "show",
              "w": "表现"
            }
          ],
          "show"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "how",
              "w": "多么"
            }
          ],
          "how"
        ],
        [
          "translation_word",
          [
            {
              "t": "intelligent",
              "w": "聪明"
            }
          ],
          "smart"
        ],
        [
          "punctuation",
          "；"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          "mother"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "kitchen",
              "w": "厨房"
            }
          ],
          "kitchen"
        ],
        [
          "translation_word",
          [
            {
              "t": "preparation",
              "w": "准备"
            }
          ],
          "preparing"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "most",
              "w": "最"
            },
            {
              "t": "love",
              "w": "爱"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "eat",
              "w": "吃"
            }
          ],
          "meals"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "evening_meal",
              "w": "晚饭"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "like"
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "proof",
              "w": "证明"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "she"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "how",
              "w": "多么"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "love",
              "w": "爱"
            }
          ],
          "loving"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          "look"
        ],
        [
          "translation_word",
          [
            {
              "t": "stand_up",
              "w": "起来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "they"
        ],
        [
          "translation_word",
          [
            {
              "t": "already",
              "w": "已经"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "each_other",
              "w": "互相"
            }
          ],
          "another"
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            },
            {
              "t": "speak",
              "w": "说话"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "quarrel",
              "w": "吵架"
            }
          ],
          "arguing"
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "awful",
              "w": "可怕"
            }
          ],
          "scary"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "quarrel",
              "w": "吵架"
            }
          ],
          "arguments"
        ],
        [
          "translation_word",
          [
            {
              "t": "apparently",
              "w": "似乎"
            }
          ],
          "somehow"
        ],
        [
          "translation_word",
          [
            {
              "t": "still",
              "w": "还"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "dregs",
              "w": "糟"
            }
          ],
          "worse"
        ],
        [
          "translation_word",
          [
            {
              "t": "obtain",
              "w": "得"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "many",
              "w": "多"
            }
          ],
          "much"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 妈妈 ， ” 哈利 对 这 片 可怕 的 沉寂 说 ， “ 我 要 测试 一 下 你 的 假说 。 按 你 的 理论 ， 我 该 怎样 派 一 只 猫头鹰 去 霍 格沃茨 呢 ？ ” ",
      "english_source": "<p>\n \"Mum,\" Harry said into the unnerving silence, \"I'm going to test\nthe hypothesis. According to your theory, how do I send an owl to\nHogwarts?\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "disk",
              "w": "片"
            }
          ],
          "silence"
        ],
        [
          "translation_word",
          [
            {
              "t": "awful",
              "w": "可怕"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "silence",
              "w": "沉寂"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          "going"
        ],
        [
          "translation_word",
          [
            {
              "t": "test",
              "w": "测试"
            }
          ],
          "test"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "down",
              "w": "下"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "your"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hypothesis",
              "w": "假说"
            }
          ],
          "hypothesis"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "press",
              "w": "按"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "theory",
              "w": "理论"
            }
          ],
          "theory"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "should",
              "w": "该"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "how",
              "w": "怎样"
            }
          ],
          "how"
        ],
        [
          "translation_word",
          [
            {
              "t": "clique",
              "w": "派"
            }
          ],
          "send"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "an"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "owl",
              "w": "猫头鹰"
            }
          ],
          "owl"
        ],
        [
          "translation_word",
          [
            {
              "t": "go",
              "w": "去"
            }
          ],
          "to"
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "particle_indicating_that_a_previously_asked_question_is_to_be_applied_to_the_preceding_word",
              "w": "呢"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "他 妈妈 从 厨房 的 料理台 前转 过 身 瞪 着 他 ， 呆 住 了 。 “ 我 —— 我 不 知道 ， 我 想 得 你 有 一 只 魔法 猫头鹰 才 行 。 ” ",
      "english_source": "<p>\n His mother turned from the kitchen sink to stare at him, looking\nshocked. \"I - I don't know, I think you just have to own a magic\nowl.\"\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mama",
              "w": "妈妈"
            }
          ],
          "mother"
        ],
        [
          "translation_word",
          [
            {
              "t": "from",
              "w": "从"
            }
          ],
          "from"
        ],
        [
          "translation_word",
          [
            {
              "t": "kitchen",
              "w": "厨房"
            }
          ],
          "kitchen"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "arrange",
              "w": "料理"
            },
            {
              "t": "Taiwan",
              "w": "台"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "front",
              "w": "前"
            },
            {
              "t": "see_轉文|转文[zhuai3_wen2]",
              "w": "转"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "PAST",
              "w": "过"
            }
          ],
          "turned"
        ],
        [
          "translation_word",
          [
            {
              "t": "body",
              "w": "身"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "open__wide",
              "w": "瞪"
            }
          ],
          "stare"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          "looking"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "him"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "foolish",
              "w": "呆"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "live",
              "w": "住"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "know",
              "w": "知道"
            }
          ],
          "know"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "think"
        ],
        [
          "translation_word",
          [
            {
              "t": "obtain",
              "w": "得"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          "have"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          "just"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          "magic"
        ],
        [
          "translation_word",
          [
            {
              "t": "owl",
              "w": "猫头鹰"
            }
          ],
          "owl"
        ],
        [
          "translation_word",
          [
            {
              "t": "ability",
              "w": "才"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "row",
              "w": "行"
            }
          ],
          "own"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "这个 听 起来 原本 是 非常 可疑 的 ， 哦 ， 这么 说 你 的 理论 就 没 办法 验证 啦 ， 可是 哈利 心里 的 那个 信念 似乎 愿意 继续 坚持 伸出 头 来 。 ",
      "english_source": "<p>\n That should've sounded highly suspicious,\n <em>\n  oh, so there's no\nway to test your theory then,\n </em>\n but the peculiar certainty in\nHarry seemed willing to stick its neck out even further.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "smile",
              "w": "听"
            }
          ],
          "sounded"
        ],
        [
          "translation_word",
          [
            {
              "t": "stand_up",
              "w": "起来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "originally",
              "w": "原本"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "非常"
            }
          ],
          "highly"
        ],
        [
          "translation_word",
          [
            {
              "t": "suspicious",
              "w": "可疑"
            }
          ],
          "suspicious"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "chant",
              "w": "哦"
            }
          ],
          "oh"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "so_much",
              "w": "这么"
            }
          ],
          "so"
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "your"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "theory",
              "w": "理论"
            }
          ],
          "theory"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "没"
            }
          ],
          "no"
        ],
        [
          "translation_word",
          [
            {
              "t": "means",
              "w": "办法"
            }
          ],
          "way"
        ],
        [
          "translation_word",
          [
            {
              "t": "inspect_and_verify",
              "w": "验证"
            }
          ],
          "test"
        ],
        [
          "translation_word",
          [
            {
              "t": "exclamation",
              "w": "啦"
            }
          ],
          "'ve"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          "but"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "chest",
              "w": "心里"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "that_one",
              "w": "那个"
            }
          ],
          "then"
        ],
        [
          "translation_word",
          [
            {
              "t": "faith",
              "w": "信念"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "apparently",
              "w": "似乎"
            }
          ],
          "seemed"
        ],
        [
          "translation_word",
          [
            {
              "t": "wish",
              "w": "愿意"
            }
          ],
          "willing"
        ],
        [
          "translation_word",
          [
            {
              "t": "continue",
              "w": "继续"
            }
          ],
          "further"
        ],
        [
          "translation_word",
          [
            {
              "t": "persevere_with",
              "w": "坚持"
            }
          ],
          "stick"
        ],
        [
          "translation_word",
          [
            {
              "t": "extend",
              "w": "伸出"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "head",
              "w": "头"
            }
          ],
          "neck"
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 好 吧 ， 既然 录取 信 能送 到 我们 这里 ， ” 哈利 说 ， “ 我 决定 到 外面 挥挥 我 的 回信 ， 叫 一 声 ’ 给 霍 格沃茨 的 信 ！ ’ 看看 会 不 会 有 一 只 猫头鹰 过来 拿 。 爸爸 ， 你 想 过来 看 吗 ？ ” ",
      "english_source": "<p>\n \"Well, the letter got here somehow,\" Harry said, \"so I'll just\nwave it around outside and call 'letter for Hogwarts!' and see if\nan owl picks it up. Dad, do you want to come and watch?\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "bar",
              "w": "吧"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "since",
              "w": "既然"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "accept_an_applicant__who_passes_an_entrance_exam",
              "w": "录取"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "能"
            },
            {
              "t": "deliver",
              "w": "送"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "到"
            }
          ],
          "got"
        ],
        [
          "translation_word",
          [
            {
              "t": "we",
              "w": "我们"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "here",
              "w": "这里"
            }
          ],
          "here"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "decide",
              "w": "决定"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "到"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "outside",
              "w": "外面"
            }
          ],
          "outside"
        ],
        [
          "translation_word",
          [
            {
              "t": "wave",
              "w": "挥"
            },
            {
              "t": "wave",
              "w": "挥"
            }
          ],
          "wave"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "reply",
              "w": "回信"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "shout",
              "w": "叫"
            }
          ],
          "call"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "sound",
              "w": "声"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "’"
        ],
        [
          "translation_word",
          [
            {
              "t": "to",
              "w": "给"
            }
          ],
          "'ll"
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "！"
        ],
        [
          "punctuation",
          "’"
        ],
        [
          "translation_word",
          [
            {
              "t": "take_a_look_at",
              "w": "看看"
            }
          ],
          "see"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "an"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "owl",
              "w": "猫头鹰"
            }
          ],
          "owl"
        ],
        [
          "translation_word",
          [
            {
              "t": "come_over",
              "w": "过来"
            }
          ],
          "around"
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "拿"
            }
          ],
          "up"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "want"
        ],
        [
          "translation_word",
          [
            {
              "t": "come_over",
              "w": "过来"
            }
          ],
          "come"
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          "watch"
        ],
        [
          "translation_word",
          [
            {
              "t": "see_嗎啡|吗啡,_morphine",
              "w": "吗"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "爸爸 微微 摇 了 摇头 ， 继续 看 书 。 当然 了 ， 哈利 想 。 魔法 是 丢人 的 事情 ， 只有 傻瓜 才 相信 ； 如果 爸爸 居然 去 验证 这个 假想 ， 或者 去 目睹 验证 的 过程 ， 就 会 感觉 是 沾 上 了 这种 东西 …… ",
      "english_source": "<p>\n His father shook his head minutely and kept on reading.\n <em>\n  Of\ncourse,\n </em>\n Harry thought to himself. Magic was a disgraceful\nthing that only stupid people believed in; if his father went so\nfar as to\n <em>\n  test\n </em>\n the hypothesis, or even\n <em>\n  watch\n </em>\n it\nbeing tested, that would feel like\n <em>\n  associating\n </em>\n himself\nwith that...\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          "father"
        ],
        [
          "translation_word",
          [
            {
              "t": "slight",
              "w": "微微"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "shake",
              "w": "摇"
            }
          ],
          "head"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "shake_one's_head",
              "w": "摇头"
            }
          ],
          "shook"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "continue",
              "w": "继续"
            }
          ],
          "kept"
        ],
        [
          "translation_word",
          [
            {
              "t": "look_after",
              "w": "看"
            }
          ],
          "reading"
        ],
        [
          "translation_word",
          [
            {
              "t": "book",
              "w": "书"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "only_natural",
              "w": "当然"
            }
          ],
          "course"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "thought"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "enchantment",
              "w": "魔法"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "lose_face",
              "w": "丢人"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "affair",
              "w": "事情"
            }
          ],
          "thing"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            },
            {
              "t": "have",
              "w": "有"
            }
          ],
          "only"
        ],
        [
          "translation_word",
          [
            {
              "t": "idiot",
              "w": "傻瓜"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ability",
              "w": "才"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "be_convinced",
              "w": "相信"
            }
          ],
          "believed"
        ],
        [
          "punctuation",
          "；"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          "if"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "unexpectedly",
              "w": "居然"
            }
          ],
          "went"
        ],
        [
          "translation_word",
          [
            {
              "t": "go",
              "w": "去"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "inspect_and_verify",
              "w": "验证"
            }
          ],
          "test"
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "imaginary",
              "w": "假想"
            }
          ],
          "hypothesis"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "or",
              "w": "或者"
            }
          ],
          "or"
        ],
        [
          "translation_word",
          [
            {
              "t": "go",
              "w": "去"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "witness",
              "w": "目睹"
            }
          ],
          "watch"
        ],
        [
          "translation_word",
          [
            {
              "t": "inspect_and_verify",
              "w": "验证"
            }
          ],
          "tested"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "course_of_events",
              "w": "过程"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          "would"
        ],
        [
          "translation_word",
          [
            {
              "t": "feel",
              "w": "感觉"
            }
          ],
          "feel"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "moisten",
              "w": "沾"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "above",
              "w": "上"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "this",
              "w": "这种"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "east_and_west",
              "w": "东西"
            }
          ],
          "like"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "……"
            }
          ],
          ""
        ]
      ]
    },
    {
      "chinese_source": "直到 哈利 走 出 后门 来到 花园 的 时候 ， 他 才 想到 ， 如果 真 的 有 一 只 猫头鹰 飞来 把 信 叼走 了 ， 他 会 很 难 向 爸爸 解释 的 。 ",
      "english_source": "<p>\n Only as Harry stumped out the back door, into the back garden,\ndid it occur to him that if an owl\n <em>\n  did\n </em>\n come down and\nsnatch the letter, he was going to have some trouble telling Dad\nabout it.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "until",
              "w": "直到"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "walk",
              "w": "走"
            }
          ],
          "back"
        ],
        [
          "translation_word",
          [
            {
              "t": "go_out",
              "w": "出"
            }
          ],
          "out"
        ],
        [
          "translation_word",
          [
            {
              "t": "the_back_door",
              "w": "后门"
            }
          ],
          "door"
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来到"
            }
          ],
          "come"
        ],
        [
          "translation_word",
          [
            {
              "t": "garden",
              "w": "花园"
            }
          ],
          "garden"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "time",
              "w": "时候"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "him"
        ],
        [
          "translation_word",
          [
            {
              "t": "ability",
              "w": "才"
            }
          ],
          "did"
        ],
        [
          "translation_word",
          [
            {
              "t": "think_of",
              "w": "想到"
            }
          ],
          "occur"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          "if"
        ],
        [
          "translation_word",
          [
            {
              "t": "really",
              "w": "真"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "an"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "owl",
              "w": "猫头鹰"
            }
          ],
          "owl"
        ],
        [
          "translation_word",
          [
            {
              "t": "fly",
              "w": "飞"
            },
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "把"
            }
          ],
          "down"
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "hold_with_one's_mouth",
              "w": "叼"
            },
            {
              "t": "walk",
              "w": "走"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "he"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          "going"
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "difficult",
              "w": "难"
            }
          ],
          "trouble"
        ],
        [
          "translation_word",
          [
            {
              "t": "towards",
              "w": "向"
            }
          ],
          "telling"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "explanation",
              "w": "解释"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "不过 － 那个 反正 也 不 会 发生 的 ， 对 不对 ？ 不管 我 的 脑子 怎么 相信 。 如果 真 的 有 一 只 猫头鹰 飞来 把 信 叼走 了 ， 事情 可 就 比 爸爸 会 怎么 想 要 严重 多 了 。 ",
      "english_source": "<p>\n <em>\n  But - well - that can't\n </em>\n really\n <em>\n  happen, can it? No\nmatter what my brain seems to believe. If an owl really comes down\nand grabs this envelope, I'm going to have worries a lot more\nimportant than what Dad thinks.\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "不过"
            }
          ],
          "well"
        ],
        [
          "punctuation",
          "－"
        ],
        [
          "translation_word",
          [
            {
              "t": "that_one",
              "w": "那个"
            }
          ],
          "that"
        ],
        [
          "translation_word",
          [
            {
              "t": "anyway",
              "w": "反正"
            }
          ],
          "'m"
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "happen",
              "w": "发生"
            }
          ],
          "happen"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "incorrect",
              "w": "不对"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "translation_word",
          [
            {
              "t": "not_to_be_concerned",
              "w": "不管"
            }
          ],
          "matter"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "my"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "brains",
              "w": "脑子"
            }
          ],
          "brain"
        ],
        [
          "translation_word",
          [
            {
              "t": "how?",
              "w": "怎么"
            }
          ],
          "what"
        ],
        [
          "translation_word",
          [
            {
              "t": "be_convinced",
              "w": "相信"
            }
          ],
          "believe"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "if",
              "w": "如果"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "really",
              "w": "真"
            }
          ],
          "really"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "have",
              "w": "有"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "owl",
              "w": "猫头鹰"
            }
          ],
          "owl"
        ],
        [
          "translation_word",
          [
            {
              "t": "fly",
              "w": "飞"
            },
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hold_with_one's_mouth",
              "w": "叼"
            },
            {
              "t": "walk",
              "w": "走"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          "down"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "affair",
              "w": "事情"
            }
          ],
          "lot"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "compared_to",
              "w": "比"
            }
          ],
          "than"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          "going"
        ],
        [
          "translation_word",
          [
            {
              "t": "how?",
              "w": "怎么"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "thinks"
        ],
        [
          "translation_word",
          [
            {
              "t": "demand",
              "w": "要"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "grave",
              "w": "严重"
            }
          ],
          "important"
        ],
        [
          "translation_word",
          [
            {
              "t": "many",
              "w": "多"
            }
          ],
          "more"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "哈利 深 吸 了 一 口 气 ， 把 信 举 向 空中 。 ",
      "english_source": "<p>\n Harry took a deep breath, and raised the envelope into the\nair.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "deep",
              "w": "深"
            }
          ],
          "deep"
        ],
        [
          "translation_word",
          [
            {
              "t": "breathe",
              "w": "吸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          "took"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mouth",
              "w": "口"
            }
          ],
          "breath"
        ],
        [
          "translation_word",
          [
            {
              "t": "gas",
              "w": "气"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lift",
              "w": "举"
            }
          ],
          "raised"
        ],
        [
          "translation_word",
          [
            {
              "t": "towards",
              "w": "向"
            }
          ],
          "into"
        ],
        [
          "translation_word",
          [
            {
              "t": "in_the_sky",
              "w": "空中"
            }
          ],
          "air"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "他 咽 了 口口水 。 ",
      "english_source": "<p>\n He swallowed.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "narrow_pass",
              "w": "咽"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "mouth",
              "w": "口"
            },
            {
              "t": "saliva",
              "w": "口水"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "他 忽然 想到 ， 在 自己 的 后 花园里 举 着 一 封 信 对 天空 大 喊 “ 给 霍 格沃茨 的 信 ！ ” ， 感觉 真的 蛮 尴尬 的 。 ",
      "english_source": "<p>\n Calling out\n <em>\n  Letter for Hogwarts!\n </em>\n while holding an\nenvelope high in the air in the middle of your own back garden\nwas... actually pretty embarrassing, now that he thought about\nit.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "忽然"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think_of",
              "w": "想到"
            }
          ],
          "thought"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          "while"
        ],
        [
          "translation_word",
          [
            {
              "t": "oneself",
              "w": "自己"
            }
          ],
          "own"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "empress",
              "w": "后"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "garden",
              "w": "花园"
            },
            {
              "t": "lining",
              "w": "里"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lift",
              "w": "举"
            }
          ],
          "holding"
        ],
        [
          "translation_word",
          [
            {
              "t": "-ing",
              "w": "着"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "grant",
              "w": "封"
            }
          ],
          "!"
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "right",
              "w": "对"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "sky",
              "w": "天空"
            }
          ],
          "air"
        ],
        [
          "translation_word",
          [
            {
              "t": "big",
              "w": "大"
            }
          ],
          "high"
        ],
        [
          "translation_word",
          [
            {
              "t": "yell",
              "w": "喊"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "to",
              "w": "给"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "！"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "feel",
              "w": "感觉"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "really",
              "w": "真"
            },
            {
              "t": "of",
              "w": "的"
            }
          ],
          "actually"
        ],
        [
          "translation_word",
          [
            {
              "t": "barbarian",
              "w": "蛮"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "awkward",
              "w": "尴尬"
            }
          ],
          "embarrassing"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "不 。 我 比 爸爸 强 。 就 算 遵行 科学 的 方法 会 让 人 觉得 很 蠢 ， 我 也 不 能 退缩 。 ",
      "english_source": "<p>\n <em>\n  No. I'm better than Dad. I will use the scientific method\neven if it makes me feel stupid.\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "compared_to",
              "w": "比"
            }
          ],
          "than"
        ],
        [
          "translation_word",
          [
            {
              "t": "father",
              "w": "爸爸"
            }
          ],
          "'m"
        ],
        [
          "translation_word",
          [
            {
              "t": "stubborn",
              "w": "强"
            }
          ],
          "better"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "regard_as",
              "w": "算"
            }
          ],
          "even"
        ],
        [
          "translation_word",
          [
            {
              "t": "follow",
              "w": "遵行"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "science",
              "w": "科学"
            }
          ],
          "scientific"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "method",
              "w": "方法"
            }
          ],
          "method"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          "will"
        ],
        [
          "translation_word",
          [
            {
              "t": "yield",
              "w": "让"
            }
          ],
          "makes"
        ],
        [
          "translation_word",
          [
            {
              "t": "man",
              "w": "人"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "觉得"
            }
          ],
          "feel"
        ],
        [
          "translation_word",
          [
            {
              "t": "very",
              "w": "很"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stupid",
              "w": "蠢"
            }
          ],
          "stupid"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "me"
        ],
        [
          "translation_word",
          [
            {
              "t": "also",
              "w": "也"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "能"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "shrink_back",
              "w": "退缩"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 给 —— ” 哈利 说 ， 可是 声音 小 得 几乎 听不见 。 ",
      "english_source": "<p>\n \"Letter -\" Harry said, but it actually came out as more of a\nwhispered croak.\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "to",
              "w": "给"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          "but"
        ],
        [
          "translation_word",
          [
            {
              "t": "voice",
              "w": "声音"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "small",
              "w": "小"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "obtain",
              "w": "得"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "almost",
              "w": "几乎"
            }
          ],
          "came"
        ],
        [
          "translation_word",
          [
            {
              "t": "not_be_able_to_hear",
              "w": "听不见"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "哈利 下定 决心 ， 向 空旷 的 天空 喊 道 ， “ 给 霍 格 沃兹 的 信 ！ 请 给 我 一 只 猫头鹰 好 吗 ？ ” ",
      "english_source": "<p>\n Harry steeled his will, and shouted into the empty sky,\n\"\n <em>\n  Letter for Hogwarts! Can I get an owl?\n </em>\n \"\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "down",
              "w": "下"
            },
            {
              "t": "set",
              "w": "定"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "determination",
              "w": "决心"
            }
          ],
          "will"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "towards",
              "w": "向"
            }
          ],
          "into"
        ],
        [
          "translation_word",
          [
            {
              "t": "spacious_and_empty",
              "w": "空旷"
            }
          ],
          "empty"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "sky",
              "w": "天空"
            }
          ],
          "sky"
        ],
        [
          "translation_word",
          [
            {
              "t": "yell",
              "w": "喊"
            }
          ],
          "shouted"
        ],
        [
          "translation_word",
          [
            {
              "t": "road",
              "w": "道"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "to",
              "w": "给"
            }
          ],
          "for"
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "square",
              "w": "格"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "fertile",
              "w": "沃"
            },
            {
              "t": "now",
              "w": "兹"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "！"
        ],
        [
          "translation_word",
          [
            {
              "t": "ask",
              "w": "请"
            }
          ],
          "get"
        ],
        [
          "translation_word",
          [
            {
              "t": "to",
              "w": "给"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "an"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "owl",
              "w": "猫头鹰"
            }
          ],
          "owl"
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "see_嗎啡|吗啡,_morphine",
              "w": "吗"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 哈利 ？ ” 一个 困惑 的 女声 问道 ， 是 他 的 一个 邻居 。 ",
      "english_source": "<p>\n \"Harry?\" asked a bemused woman's voice, one of the\nneighbours.\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "bewildered",
              "w": "困惑"
            }
          ],
          "bemused"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "female",
              "w": "女"
            },
            {
              "t": "sound",
              "w": "声"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ask_the_way",
              "w": "问道"
            }
          ],
          "asked"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          "'s"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "one"
        ],
        [
          "translation_word",
          [
            {
              "t": "neighbor",
              "w": "邻居"
            }
          ],
          "neighbours"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "哈利 像 被 火烫 了 一样 把手 收 回来 ， 把 信 藏 在 身后 ， 就 像 那 是 贩毒 得 来 的 黑钱 一样 。 他 的 整 张 脸 都 在 因为 羞耻 而 发 烫 。 ",
      "english_source": "<p>\n Harry pulled down his hand like it was on fire and hid the\nenvelope behind his back like it was drug money. His whole face was\nhot with shame.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "resemble",
              "w": "像"
            }
          ],
          "like"
        ],
        [
          "translation_word",
          [
            {
              "t": "to_cover",
              "w": "被"
            }
          ],
          "was"
        ],
        [
          "translation_word",
          [
            {
              "t": "burning_hot",
              "w": "火烫"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "same",
              "w": "一样"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "handle",
              "w": "把手"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "receive",
              "w": "收"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "return",
              "w": "回来"
            }
          ],
          "back"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "Tibet",
              "w": "藏"
            }
          ],
          "hid"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "posthumous",
              "w": "身后"
            }
          ],
          "behind"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "resemble",
              "w": "像"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "that",
              "w": "那"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "traffic_narcotics",
              "w": "贩毒"
            }
          ],
          "drug"
        ],
        [
          "translation_word",
          [
            {
              "t": "obtain",
              "w": "得"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "dirty_money",
              "w": "黑钱"
            }
          ],
          "money"
        ],
        [
          "translation_word",
          [
            {
              "t": "same",
              "w": "一样"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "exactly",
              "w": "整"
            }
          ],
          "whole"
        ],
        [
          "translation_word",
          [
            {
              "t": "open_up",
              "w": "张"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "face",
              "w": "脸"
            }
          ],
          "face"
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "都"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "because",
              "w": "因为"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "shame",
              "w": "羞耻"
            }
          ],
          "shame"
        ],
        [
          "translation_word",
          [
            {
              "t": "and",
              "w": "而"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "send_out",
              "w": "发"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "scald",
              "w": "烫"
            }
          ],
          "hot"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "一个 老太太 的 脸 从 邻居 的 篱笆 墙上 伸 出来 ， 她 的 头发 是 灰白色 的 ， 毛茸茸 地 从 发网 里 漏 出来 。 是 费 格 太太 ， 她 偶然 会 做 他 的 临时 保姆 。 “ 你 在 干 什么 ， 哈利 ？ ” ",
      "english_source": "<p>\n An old woman's face peered out from above the neighbouring\nfence, grizzled grey hair escaping from her hairnet. Mrs. Figg, the\noccasional babysitter. \"What are you doing, Harry?\"\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "elderly_lady",
              "w": "老太太"
            }
          ],
          "woman"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "face",
              "w": "脸"
            }
          ],
          "face"
        ],
        [
          "translation_word",
          [
            {
              "t": "from",
              "w": "从"
            }
          ],
          "from"
        ],
        [
          "translation_word",
          [
            {
              "t": "neighbor",
              "w": "邻居"
            }
          ],
          "neighbouring"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "fence",
              "w": "篱笆"
            }
          ],
          "fence"
        ],
        [
          "translation_word",
          [
            {
              "t": "wall",
              "w": "墙"
            },
            {
              "t": "above",
              "w": "上"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stretch",
              "w": "伸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come_out",
              "w": "出来"
            }
          ],
          "out"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "her"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hair",
              "w": "头发"
            }
          ],
          "hair"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "ash_gray",
              "w": "灰白色"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "hairy",
              "w": "毛茸茸"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "-ly",
              "w": "地"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "from",
              "w": "从"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hairnet",
              "w": "发网"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lining",
              "w": "里"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "leak",
              "w": "漏"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come_out",
              "w": "出来"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "cost",
              "w": "费"
            }
          ],
          "babysitter"
        ],
        [
          "translation_word",
          [
            {
              "t": "square",
              "w": "格"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "married_woman",
              "w": "太太"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "incidentally",
              "w": "偶然"
            }
          ],
          "occasional"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "会"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "do",
              "w": "做"
            }
          ],
          "doing"
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "as_the_time_draws_near",
              "w": "临时"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "nanny",
              "w": "保姆"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "dry",
              "w": "干"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "what?",
              "w": "什么"
            }
          ],
          "?"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 没什么 ， ” 哈利 用 一 种 像 被 掐 住 了 喉咙 似的 声音 答道 。 “ 只 是 在 —— 测试 一个 可笑 的 理论 —— ” ",
      "english_source": "<p>\n \"Nothing,\" Harry said in a strangled voice. \"Just - testing a\nreally silly theory -\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "nothing",
              "w": "没什么"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "seed",
              "w": "种"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "resemble",
              "w": "像"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "to_cover",
              "w": "被"
            }
          ],
          "strangled"
        ],
        [
          "translation_word",
          [
            {
              "t": "pick",
              "w": "掐"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "live",
              "w": "住"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "throat",
              "w": "喉咙"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "seems_as_if",
              "w": "似的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "voice",
              "w": "声音"
            }
          ],
          "voice"
        ],
        [
          "translation_word",
          [
            {
              "t": "answer",
              "w": "答"
            },
            {
              "t": "road",
              "w": "道"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "only",
              "w": "只"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "translation_word",
          [
            {
              "t": "test",
              "w": "测试"
            }
          ],
          "testing"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "funny",
              "w": "可笑"
            }
          ],
          "really"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "theory",
              "w": "理论"
            }
          ],
          "theory"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 你 收到 霍 格沃茨 的 录取 信 了 ？ ” ",
      "english_source": "<p>\n \"Did you get your acceptance letter from Hogwarts?\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "your"
        ],
        [
          "translation_word",
          [
            {
              "t": "receive",
              "w": "收到"
            }
          ],
          "get"
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "accept_an_applicant__who_passes_an_entrance_exam",
              "w": "录取"
            }
          ],
          "acceptance"
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "？"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "哈利 僵住 了 。 ",
      "english_source": "<p>\n Harry froze in place\n <em>\n  .\n </em>\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "motionless",
              "w": "僵住"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 是的 ， ” 哈利 的 嘴唇 在 沉默 了 一会儿 以后 答道 ， “ 我 收到 一 封 从 霍 格沃茨 寄 来 的 信 。 他们 说 让 我 的 猫头鹰 在 七月 三十一 号 之前 送信 过去 ， 可是 —— ” ",
      "english_source": "<p>\n \"Yes,\" Harry's lips said a little while later. \"I got a letter\nfrom Hogwarts. They say they want my owl by the 31st of July, but\n-\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "yes,_that's_right",
              "w": "是的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lip",
              "w": "嘴唇"
            }
          ],
          "lips"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "taciturn",
              "w": "沉默"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "a_moment",
              "w": "一会儿"
            }
          ],
          "while"
        ],
        [
          "translation_word",
          [
            {
              "t": "after",
              "w": "以后"
            }
          ],
          "later"
        ],
        [
          "translation_word",
          [
            {
              "t": "answer",
              "w": "答"
            },
            {
              "t": "road",
              "w": "道"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "receive",
              "w": "收到"
            }
          ],
          "got"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "grant",
              "w": "封"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "from",
              "w": "从"
            }
          ],
          "from"
        ],
        [
          "translation_word",
          [
            {
              "t": "suddenly",
              "w": "霍"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "格沃茨"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "send",
              "w": "寄"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "they",
              "w": "他们"
            }
          ],
          "they"
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "say"
        ],
        [
          "translation_word",
          [
            {
              "t": "yield",
              "w": "让"
            }
          ],
          "want"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "my"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "owl",
              "w": "猫头鹰"
            }
          ],
          "owl"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "July",
              "w": "七月"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "three",
              "w": "三"
            },
            {
              "t": "eleven",
              "w": "十一"
            }
          ],
          "31st"
        ],
        [
          "translation_word",
          [
            {
              "t": "roar",
              "w": "号"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "before",
              "w": "之前"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "send_word",
              "w": "送信"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "past",
              "w": "过去"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "but",
              "w": "可是"
            }
          ],
          "but"
        ],
        [
          "translation_word",
          [
            {
              "t": "..",
              "w": "——"
            }
          ],
          "-"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "“ 可 是 你 没有 猫头鹰 。 倒霉 孩子 ！ 我 简直不 知道 那些 人 是 怎么 想 的 ， 就 这样 把 普通 的 信 寄 给 你 。 ” ",
      "english_source": "<p>\n \"But you don't\n <em>\n  have\n </em>\n an owl. Poor dear! I can't imagine\n <em>\n  what\n </em>\n someone must have been thinking, sending you just the\nstandard letter.\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "can",
              "w": "可"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          "you"
        ],
        [
          "translation_word",
          [
            {
              "t": "haven't",
              "w": "没有"
            }
          ],
          "n't"
        ],
        [
          "translation_word",
          [
            {
              "t": "owl",
              "w": "猫头鹰"
            }
          ],
          "owl"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "have_bad_luck",
              "w": "倒霉"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "child",
              "w": "孩子"
            }
          ],
          "ca"
        ],
        [
          "punctuation",
          "！"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "simply",
              "w": "简直"
            },
            {
              "t": "not",
              "w": "不"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "know",
              "w": "知道"
            }
          ],
          "what"
        ],
        [
          "translation_word",
          [
            {
              "t": "those",
              "w": "那些"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "man",
              "w": "人"
            }
          ],
          "someone"
        ],
        [
          "translation_word",
          [
            {
              "t": "is",
              "w": "是"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "how?",
              "w": "怎么"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "thinking"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          "just"
        ],
        [
          "translation_word",
          [
            {
              "t": "this_kind_of",
              "w": "这样"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "common",
              "w": "普通"
            }
          ],
          "standard"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "letter",
              "w": "信"
            }
          ],
          "letter"
        ],
        [
          "translation_word",
          [
            {
              "t": "send",
              "w": "寄"
            }
          ],
          "sending"
        ],
        [
          "translation_word",
          [
            {
              "t": "to",
              "w": "给"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "you",
              "w": "你"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "一 条 布满 皱纹 的 手臂 从 篱笆 后面 伸 出来 ， 张 开手 。 哈利 想 都 没 想 就 把 他 的 信封 递 了 过去 。 ",
      "english_source": "<p>\n A wrinkled arm stretched out over the fence, and opened an\nexpectant hand. Hardly even thinking at this point, Harry gave over\nhis envelope.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "strip",
              "w": "条"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "be_covered_with",
              "w": "布满"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "wrinkle",
              "w": "皱纹"
            }
          ],
          "wrinkled"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "arm",
              "w": "手臂"
            }
          ],
          "arm"
        ],
        [
          "translation_word",
          [
            {
              "t": "from",
              "w": "从"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "fence",
              "w": "篱笆"
            }
          ],
          "fence"
        ],
        [
          "translation_word",
          [
            {
              "t": "rear",
              "w": "后面"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "stretch",
              "w": "伸"
            }
          ],
          "stretched"
        ],
        [
          "translation_word",
          [
            {
              "t": "come_out",
              "w": "出来"
            }
          ],
          "out"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "open_up",
              "w": "张"
            }
          ],
          "opened"
        ],
        [
          "translation_word",
          [
            {
              "t": "open",
              "w": "开"
            },
            {
              "t": "hand",
              "w": "手"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "translation_word",
          [
            {
              "t": "Harry",
              "w": "哈利"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "point"
        ],
        [
          "translation_word",
          [
            {
              "t": "all",
              "w": "都"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "not",
              "w": "没"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "think",
              "w": "想"
            }
          ],
          "thinking"
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "把"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "he_or_him",
              "w": "他"
            }
          ],
          "his"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "envelope",
              "w": "信封"
            }
          ],
          "envelope"
        ],
        [
          "translation_word",
          [
            {
              "t": "hand_over",
              "w": "递"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          "gave"
        ],
        [
          "translation_word",
          [
            {
              "t": "past",
              "w": "过去"
            }
          ],
          "over"
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "“ 包在 我 身上 ， 亲爱 的 ， ” 费 格 女士 说 。 “ 我 一会儿 就 叫 人 来 拿 。 ” ",
      "english_source": "<p>\n \"Just leave it to me, dear,\" said Mrs. Figg, \"and in a jiffy or\ntwo I'll have someone over.\"\n</p>\n",
      "translation": [
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "cover",
              "w": "包"
            },
            {
              "t": "at",
              "w": "在"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          "me"
        ],
        [
          "translation_word",
          [
            {
              "t": "on_the_body",
              "w": "身上"
            }
          ],
          "leave"
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "dear",
              "w": "亲爱"
            }
          ],
          "dear"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "”"
        ],
        [
          "translation_word",
          [
            {
              "t": "cost",
              "w": "费"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "square",
              "w": "格"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "lady",
              "w": "女士"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "persuade",
              "w": "说"
            }
          ],
          "said"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "I",
              "w": "我"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "a_moment",
              "w": "一会儿"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "at_once",
              "w": "就"
            }
          ],
          "'ll"
        ],
        [
          "translation_word",
          [
            {
              "t": "shout",
              "w": "叫"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "man",
              "w": "人"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "come",
              "w": "来"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "hold",
              "w": "拿"
            }
          ],
          "someone"
        ],
        [
          "punctuation",
          "。"
        ],
        [
          "punctuation",
          "”"
        ]
      ]
    },
    {
      "chinese_source": "她 的 脸 在 栅栏 另 一 端 消失了 。 ",
      "english_source": "<p>\n And her face disappeared from over the fence.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "she",
              "w": "她"
            }
          ],
          "her"
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "face",
              "w": "脸"
            }
          ],
          "face"
        ],
        [
          "translation_word",
          [
            {
              "t": "at",
              "w": "在"
            }
          ],
          "over"
        ],
        [
          "translation_word",
          [
            {
              "t": "fence",
              "w": "栅栏"
            }
          ],
          "fence"
        ],
        [
          "translation_word",
          [
            {
              "t": "other",
              "w": "另"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "end",
              "w": "端"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "disappear",
              "w": "消失"
            },
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "花园里 寂静 了 好 一会儿 。 ",
      "english_source": "<p>\n There was a long silence in the garden.\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "garden",
              "w": "花园"
            },
            {
              "t": "lining",
              "w": "里"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "quiet",
              "w": "寂静"
            }
          ],
          "silence"
        ],
        [
          "translation_word",
          [
            {
              "t": "did",
              "w": "了"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "good",
              "w": "好"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "a_moment",
              "w": "一会儿"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "。"
        ]
      ]
    },
    {
      "chinese_source": "接着 ， 一个 男 孩 用 镇静 的 声音 低声说 ， “ 什么 ？ ",
      "english_source": "<p>\n Then a boy's voice said, calmly and quietly, \"What.\"\n</p>\n",
      "translation": [
        [
          "translation_word",
          [
            {
              "t": "catch_and_hold_on",
              "w": "接着"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "translation_word",
          [
            {
              "t": "one",
              "w": "一"
            },
            {
              "t": "individual",
              "w": "个"
            }
          ],
          "a"
        ],
        [
          "translation_word",
          [
            {
              "t": "male",
              "w": "男"
            }
          ],
          "boy"
        ],
        [
          "translation_word",
          [
            {
              "t": "child",
              "w": "孩"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "use",
              "w": "用"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "calm",
              "w": "镇静"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "of",
              "w": "的"
            }
          ],
          ""
        ],
        [
          "translation_word",
          [
            {
              "t": "voice",
              "w": "声音"
            }
          ],
          "voice"
        ],
        [
          "translation_word",
          [
            {
              "t": "low",
              "w": "低"
            },
            {
              "t": "narrate",
              "w": "声说"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "，"
        ],
        [
          "punctuation",
          "“"
        ],
        [
          "translation_word",
          [
            {
              "t": "what?",
              "w": "什么"
            }
          ],
          ""
        ],
        [
          "punctuation",
          "？"
        ]
      ]
    }
  ]
}
